// Anything with "null" requires a translation. Contribute to translation via a PR!
const TRANSLATIONS = {
  onboarding: {
    survey: {
      email: "آدرس ایمیل شما چیست؟",
      useCase: "شما از AnythingLLM برای چه منظوری استفاده خواهید کرد؟",
      useCaseWork: "برای کار",
      useCasePersonal: "برای استفاده شخصی",
      useCaseOther: "سایر",
      comment: "شما از کجا در مورد AnythingLLM مطلع شدید؟",
      commentPlaceholder:
        "Reddit، توییتر، گیت‌هاب، یوتیوب و غیره - لطفاً به ما بگویید که چگونه ما را پیدا کردید!",
      skip: "پرش از نظرسنجی",
      thankYou: "از بازخورد شما سپاسگزاریم.",
      title: "به AnythingLLM خوش آمدید",
      description:
        "ما را در ساخت مدل AnythingLLM متناسب با نیازهای شما یاری دهید. (این بخش اختیاری است)",
    },
    home: {
      title: "به",
      getStarted: "شروع کنید",
    },
    llm: {
      title: "ترجیحات مدل‌های زبان بزرگ",
      description:
        "AnythingLLM می‌تواند با بسیاری از ارائه‌دهندگان مدل‌های زبانی کار کند. این سرویس، مسئولیت انجام مکالمات را بر عهده خواهد داشت.",
    },
    userSetup: {
      title: "راه‌اندازی حساب کاربری",
      description: "تنظیمات کاربری خود را انجام دهید.",
      howManyUsers:
        "تعداد کاربران که از این نمونه استفاده خواهند کرد چقدر است؟",
      justMe: "فقط من",
      myTeam: "تیم من",
      instancePassword: "رمز عبور",
      setPassword: "آیا می‌خواهید یک رمز عبور تعیین کنید؟",
      passwordReq: "رمز عبور باید حداقل 8 کاراکتر باشد.",
      passwordWarn:
        "مهم است که این رمز عبور را حفظ کنید، زیرا هیچ روشی برای بازیابی آن وجود ندارد.",
      adminUsername: "نام کاربری حساب مدیر",
      adminPassword: "رمز عبور حساب کاربری",
      adminPasswordReq: "رمز عبور باید حداقل 8 کاراکتر باشد.",
      teamHint:
        "به طور پیش‌فرض، شما تنها مدیر خواهید بود. پس از اتمام فرآیند ثبت‌نام، می‌توانید افراد دیگری را به عنوان کاربران یا مدیران اضافه کنید. لطفاً رمز عبور خود را فراموش نکنید، زیرا تنها مدیران می‌توانند رمز عبور را بازنشانی کنند.",
    },
    data: {
      title: "مدیریت داده‌ها و حریم خصوصی",
      description:
        "ما متعهد به شفافیت و کنترل در رابطه با اطلاعات شخصی شما هستیم.",
      settingsHint:
        "این تنظیمات می‌توانند در هر زمان در بخش تنظیمات تغییر داده شوند.",
    },
    workspace: {
      title: "ایجاد فضای کاری اول خود",
      description:
        "فضای کاری خود را ایجاد کنید و با AnythingLLM شروع به کار کنید.",
    },
  },
  common: {
    "workspaces-name": "نام فضای کار",
    error: "خطا",
    success: "موفق",
    user: "کاربر",
    selection: "انتخاب مدل",
    saving: "در حال ذخیره...",
    save: "ذخیره تغییرات",
    previous: "صفحه قبلی",
    next: "صفحه بعدی",
    optional: "اختیاری",
    yes: "بله",
    no: "نه",
    search: "جستجو",
    username_requirements:
      "نام کاربری باید 2 تا 32 کاراکتر باشد، با حرف کوچک شروع شود و فقط شامل حروف کوچک، اعداد، زیرخط، خط تیره و نقطه باشد.",
  },
  settings: {
    title: "تنظیمات سامانه",
    system: "تنظیمات عمومی",
    invites: "دعوت‌نامه‌ها",
    users: "کاربران",
    workspaces: "فضاهای کاری",
    "workspace-chats": "گفتگوهای فضای کاری",
    customization: "شخصی‌سازی",
    "api-keys": "API توسعه‌دهندگان",
    llm: "مدل زبانی",
    transcription: "رونویسی",
    embedder: "جاسازی",
    "text-splitting": "تقسیم متن و تکه‌بندی",
    "voice-speech": "صدا و گفتار",
    "vector-database": "پایگاه داده برداری",
    embeds: "جاسازی گفتگو",
    "embed-chats": "تاریخچه گفتگوهای جاسازی شده",
    security: "امنیت",
    "event-logs": "گزارش رویدادها",
    privacy: "حریم خصوصی و داده‌ها",
    "ai-providers": "ارائه‌دهندگان هوش مصنوعی",
    "agent-skills": "مهارت‌های عامل",
    admin: "مدیریت",
    tools: "ابزارها",
    "experimental-features": "ویژگی‌های آزمایشی",
    contact: "تماس با پشتیبانی",
    "browser-extension": "افزونه مرورگر",
    "system-prompt-variables": "متغیرهای اعلان سیستم\n\n\nمتغیرهای اعلان سیستم",
    interface: "تنظیمات رابط کاربری",
    branding: "برندسازی و تولید محصولات با برچسب سفید",
    chat: "چت",
    "mobile-app": "AnythingLLM Mobile",
  },
  login: {
    "multi-user": {
      welcome: "خوش آمدید به",
      "placeholder-username": "نام کاربری",
      "placeholder-password": "رمز عبور",
      login: "ورود",
      validating: "در حال اعتبارسنجی...",
      "forgot-pass": "فراموشی رمز عبور",
      reset: "بازنشانی",
    },
    "sign-in": "ورود به حساب {{appName}} کاربری شما.",
    "password-reset": {
      title: "بازنشانی رمز عبور",
      description: "برای بازنشانی رمز عبور خود، اطلاعات لازم را وارد کنید.",
      "recovery-codes": "کدهای بازیابی",
      "recovery-code": "کد بازیابی {{index}}",
      "back-to-login": "بازگشت به صفحه ورود",
    },
  },
  "new-workspace": {
    title: "فضای کاری جدید",
    placeholder: "فضای کاری من",
  },
  "workspaces—settings": {
    general: "تنظیمات عمومی",
    chat: "تنظیمات گفتگو",
    vector: "پایگاه داده برداری",
    members: "اعضا",
    agent: "پیکربندی عامل",
  },
  general: {
    vector: {
      title: "تعداد بردارها",
      description: "تعداد کل بردارها در پایگاه داده برداری شما.",
    },
    names: {
      description: "این فقط نام نمایشی فضای کاری شما را تغییر خواهد داد.",
    },
    message: {
      title: "پیام‌های گفتگوی پیشنهادی",
      description:
        "پیام‌هایی که به کاربران فضای کاری پیشنهاد می‌شود را شخصی‌سازی کنید.",
      add: "افزودن پیام جدید",
      save: "ذخیره پیام‌ها",
      heading: "برایم توضیح بده",
      body: "مزایای AnythingLLM را",
    },
    pfp: {
      title: "تصویر پروفایل دستیار",
      description: "تصویر پروفایل دستیار را برای این فضای کاری شخصی‌سازی کنید.",
      image: "تصویر فضای کاری",
      remove: "حذف تصویر فضای کاری",
    },
    delete: {
      title: "حذف فضای کاری",
      description:
        "این فضای کاری و تمام داده‌های آن را حذف کنید. این کار فضای کاری را برای همه کاربران حذف خواهد کرد.",
      delete: "حذف فضای کاری",
      deleting: "در حال حذف فضای کاری...",
      "confirm-start": "شما در حال حذف کامل",
      "confirm-end":
        "فضای کاری هستید. این کار تمام جاسازی‌های برداری را از پایگاه داده برداری شما حذف خواهد کرد.\n\nفایل‌های اصلی منبع دست نخورده باقی خواهند ماند. این عمل برگشت‌ناپذیر است.",
    },
  },
  chat: {
    llm: {
      title: "ارائه‌دهنده LLM فضای کاری",
      description:
        "ارائه‌دهنده و مدل LLM خاصی که برای این فضای کاری استفاده خواهد شد. به طور پیش‌فرض، از ارائه‌دهنده و تنظیمات LLM سیستم استفاده می‌کند.",
      search: "جستجوی تمام ارائه‌دهندگان LLM",
    },
    model: {
      title: "مدل گفتگوی فضای کاری",
      description:
        "مدل گفتگوی خاصی که برای این فضای کاری استفاده خواهد شد. اگر خالی باشد، از ترجیحات LLM سیستم استفاده خواهد کرد.",
      wait: "-- در انتظار مدل‌ها --",
    },
    mode: {
      title: "حالت گفتگو",
      chat: {
        title: "گفتگو",
        "desc-start": "پاسخ‌ها را با دانش عمومی LLM",
        and: "و",
        "desc-end": "محتوای اسناد یافت شده ارائه می‌دهد.",
      },
      query: {
        title: "پرس‌وجو",
        "desc-start": "پاسخ‌ها را",
        only: "فقط",
        "desc-end": "در صورت یافتن محتوای اسناد ارائه می‌دهد.",
      },
    },
    history: {
      title: "تاریخچه گفتگو",
      "desc-start":
        "تعداد گفتگوهای قبلی که در حافظه کوتاه‌مدت پاسخ گنجانده خواهد شد.",
      recommend: "پیشنهاد: ۲۰. ",
      "desc-end":
        "بیش از ۴۵ احتمالاً منجر به شکست مداوم گفتگو می‌شود که به اندازه پیام‌ها بستگی دارد.",
    },
    prompt: {
      title: "پیش‌متن",
      description:
        "پیش‌متنی که در این فضای کاری استفاده خواهد شد. زمینه و دستورالعمل‌ها را برای تولید پاسخ توسط هوش مصنوعی تعریف کنید. باید یک پیش‌متن دقیق ارائه دهید تا هوش مصنوعی بتواند پاسخی مرتبط و دقیق تولید کند.",
      history: {
        title: "تاریخچه دستورات سیستم",
        clearAll: "پاک کردن همه",
        noHistory: "هیچ سابقه دستورالعمل در دسترس نیست.",
        restore: "بازگرداندن",
        delete: "حذف",
        deleteConfirm:
          "آیا مطمئن هستید که می‌خواهید این آیتم تاریخ را حذف کنید؟",
        clearAllConfirm:
          "آیا مطمئن هستید که می‌خواهید تمام تاریخچه را پاک کنید؟ این اقدام قابل لغو نیست.",
        expand: "گسترش",
        publish: "انتشار در مرکز جامعه",
      },
    },
    refusal: {
      title: "پاسخ رد در حالت پرس‌وجو",
      "desc-start": "در حالت",
      query: "پرس‌وجو",
      "desc-end":
        "ممکن است بخواهید هنگامی که هیچ محتوایی یافت نمی‌شود، یک پاسخ رد سفارشی برگردانید.",
      "tooltip-title": "من این را می‌بینم، چرا؟",
      "tooltip-description":
        "شما در حالت پرس‌وجو هستید، که تنها از اطلاعات موجود در اسناد شما استفاده می‌کند. برای گفتگوهای انعطاف‌پذیرتر، به حالت چت بروید، یا برای کسب اطلاعات بیشتر در مورد حالت‌های چت، اینجا را کلیک کنید.",
    },
    temperature: {
      title: "دمای LLM",
      "desc-start":
        'این تنظیم میزان "خلاقیت" پاسخ‌های LLM شما را کنترل می‌کند.',
      "desc-end":
        "هر چه عدد بالاتر باشد، خلاقیت بیشتر است. برای برخی مدل‌ها، تنظیم بسیار بالا می‌تواند منجر به پاسخ‌های نامفهوم شود.",
      hint: "اکثر LLMها محدوده‌های مختلفی از مقادیر معتبر را دارند. برای این اطلاعات به ارائه‌دهنده LLM خود مراجعه کنید.",
    },
  },
  "vector-workspace": {
    identifier: "شناسه پایگاه داده برداری",
    snippets: {
      title: "حداکثر قطعات متنی",
      description:
        "این تنظیم حداکثر تعداد قطعات متنی که برای هر گفتگو یا پرس‌وجو به LLM ارسال می‌شود را کنترل می‌کند.",
      recommend: "پیشنهادی: 4",
    },
    doc: {
      title: "آستانه شباهت سند",
      description:
        "حداقل امتیاز شباهت مورد نیاز برای اینکه یک منبع مرتبط با گفتگو در نظر گرفته شود. هر چه عدد بالاتر باشد، منبع باید شباهت بیشتری با گفتگو داشته باشد.",
      zero: "بدون محدودیت",
      low: "پایین (امتیاز شباهت ≥ .25)",
      medium: "متوسط (امتیاز شباهت ≥ .50)",
      high: "بالا (امتیاز شباهت ≥ .75)",
    },
    reset: {
      reset: "بازنشانی پایگاه داده برداری",
      resetting: "در حال پاک کردن بردارها...",
      confirm:
        "شما در حال بازنشانی پایگاه داده برداری این فضای کاری هستید. این کار تمام جاسازی‌های برداری فعلی را حذف خواهد کرد.\n\nفایل‌های اصلی منبع دست نخورده باقی خواهند ماند. این عمل برگشت‌ناپذیر است.",
      error: "بازنشانی پایگاه داده برداری فضای کاری امکان‌پذیر نبود!",
      success: "پایگاه داده برداری فضای کاری بازنشانی شد!",
    },
  },
  agent: {
    "performance-warning":
      "عملکرد LLMهایی که به طور صریح از فراخوانی ابزار پشتیبانی نمی‌کنند، به شدت به قابلیت‌ها و دقت مدل وابسته است. برخی توانایی‌ها ممکن است محدود یا غیرفعال باشند.",
    provider: {
      title: "ارائه‌دهنده LLM عامل فضای کاری",
      description:
        "ارائه‌دهنده و مدل LLM خاصی که برای عامل @agent این فضای کاری استفاده خواهد شد.",
    },
    mode: {
      chat: {
        title: "مدل گفتگوی عامل فضای کاری",
        description:
          "مدل گفتگوی خاصی که برای عامل @agent این فضای کاری استفاده خواهد شد.",
      },
      title: "مدل عامل فضای کاری",
      description:
        "مدل LLM خاصی که برای عامل @agent این فضای کاری استفاده خواهد شد.",
      wait: "-- در انتظار مدل‌ها --",
    },
    skill: {
      title: "مهارت‌های پیش‌فرض عامل",
      description:
        "توانایی‌های طبیعی عامل پیش‌فرض را با این مهارت‌های از پیش ساخته شده بهبود دهید. این تنظیمات برای تمام فضاهای کاری اعمال می‌شود.",
      rag: {
        title: "RAG و حافظه بلندمدت",
        description:
          'به عامل اجازه دهید از اسناد محلی شما برای پاسخ به پرس‌وجو استفاده کند یا از عامل بخواهید قطعات محتوا را برای بازیابی حافظه بلندمدت "به خاطر بسپارد".',
      },
      view: {
        title: "مشاهده و خلاصه‌سازی اسناد",
        description:
          "به عامل اجازه دهید محتوای فایل‌های جاسازی شده فعلی فضای کاری را فهرست و خلاصه کند.",
      },
      scrape: {
        title: "استخراج از وب‌سایت‌ها",
        description:
          "به عامل اجازه دهید محتوای وب‌سایت‌ها را بازدید و استخراج کند.",
      },
      generate: {
        title: "تولید نمودارها",
        description:
          "به عامل پیش‌فرض امکان تولید انواع مختلف نمودار از داده‌های ارائه شده یا داده شده در گفتگو را بدهید.",
      },
      save: {
        title: "تولید و ذخیره فایل‌ها در مرورگر",
        description:
          "به عامل پیش‌فرض امکان تولید و نوشتن در فایل‌هایی که ذخیره می‌شوند و می‌توانند در مرورگر شما دانلود شوند را بدهید.",
      },
      web: {
        title: "جستجو و مرور زنده وب",
        "desc-start":
          "با اتصال به یک ارائه‌دهنده جستجوی وب (SERP)، به عامل خود امکان جستجو در وب برای پاسخ به سؤالات خود را بدهید.",
        "desc-end":
          "جستجوی وب در طول جلسات عامل تا زمانی که این تنظیم نشود، کار نخواهد کرد.",
      },
    },
  },
  recorded: {
    title: "گفتگوهای فضای کاری",
    description:
      "این‌ها تمام گفتگوها و پیام‌های ثبت شده هستند که توسط کاربران ارسال شده‌اند و بر اساس تاریخ ایجاد مرتب شده‌اند.",
    export: "خروجی‌گیری",
    table: {
      id: "شناسه",
      by: "ارسال شده توسط",
      workspace: "فضای کاری",
      prompt: "درخواست",
      response: "پاسخ",
      at: "زمان ارسال",
    },
  },
  api: {
    title: "کلیدهای API",
    description:
      "کلیدهای API به دارنده آن‌ها اجازه می‌دهند به صورت برنامه‌نویسی به این نمونه AnythingLLM دسترسی داشته و آن را مدیریت کنند.",
    link: "مطالعه مستندات API",
    generate: "ایجاد کلید API جدید",
    table: {
      key: "کلید API",
      by: "ایجاد شده توسط",
      created: "تاریخ ایجاد",
    },
  },
  llm: {
    title: "ترجیحات مدل زبانی",
    description:
      "این‌ها اعتبارنامه‌ها و تنظیمات ارائه‌دهنده مدل زبانی و جاسازی انتخابی شما هستند. مهم است که این کلیدها به‌روز و صحیح باشند در غیر این صورت AnythingLLM به درستی کار نخواهد کرد.",
    provider: "ارائه‌دهنده مدل زبانی",
    providers: {
      azure_openai: {
        azure_service_endpoint: "پایان‌نقطه سرویس Azure",
        api_key: "کلید API",
        chat_deployment_name: "نام استقرار چت",
        chat_model_token_limit: "محدودیت تعداد توکن در مدل چت",
        model_type: "نوع مدل",
        default: "پیش‌فرض",
        reasoning: "استدلال",
        model_type_tooltip:
          'اگر سیستم شما از یک مدل استدلال (مانند o1، o1-mini، o3-mini و غیره) استفاده می‌کند، این گزینه را روی "استدلال" تنظیم کنید. در غیر این صورت، درخواست‌های چت شما ممکن است با شکست مواجه شوند.',
      },
    },
  },
  transcription: {
    title: "ترجیحات مدل رونویسی",
    description:
      "این‌ها اعتبارنامه‌ها و تنظیمات ارائه‌دهنده مدل رونویسی انتخابی شما هستند. مهم است که این کلیدها به‌روز و صحیح باشند در غیر این صورت فایل‌های رسانه و صوتی رونویسی نخواهند شد.",
    provider: "ارائه‌دهنده رونویسی",
    "warn-start":
      "استفاده از مدل محلی Whisper روی دستگاه‌هایی با RAM یا CPU محدود می‌تواند هنگام پردازش فایل‌های رسانه‌ای باعث توقف AnythingLLM شود.",
    "warn-recommend":
      "ما حداقل ۲ گیگابایت RAM و آپلود فایل‌های کمتر از ۱۰ مگابایت را توصیه می‌کنیم.",
    "warn-end": "مدل داخلی در اولین استفاده به صورت خودکار دانلود خواهد شد.",
  },
  embedding: {
    title: "ترجیحات جاسازی",
    "desc-start":
      "هنگام استفاده از یک LLM که به طور پیش‌فرض از موتور جاسازی پشتیبانی نمی‌کند - ممکن است نیاز به تعیین اعتبارنامه‌های اضافی برای جاسازی متن داشته باشید.",
    "desc-end":
      "جاسازی فرآیند تبدیل متن به بردارها است. این اعتبارنامه‌ها برای تبدیل فایل‌ها و درخواست‌های شما به فرمتی که AnythingLLM بتواند پردازش کند، ضروری هستند.",
    provider: {
      title: "ارائه‌دهنده جاسازی",
    },
  },
  text: {
    title: "تقسیم متن و تکه‌بندی",
    "desc-start":
      "تقسیم متن به شما امکان می‌دهد اسناد بزرگ را به بخش‌های کوچک‌تر تقسیم کنید که برای جاسازی و پردازش مناسب‌تر هستند.",
    "desc-end":
      "سعی کنید تعادلی بین اندازه بخش و همپوشانی ایجاد کنید تا از دست رفتن اطلاعات را به حداقل برسانید.",
    size: {
      title: "حداکثر اندازه بخش",
      description:
        "این حداکثر تعداد کاراکترهایی است که می‌تواند در یک بردار وجود داشته باشد.",
      recommend: "حداکثر طول مدل جاسازی",
    },
    overlap: {
      title: "همپوشانی بخش‌های متن",
      description:
        "این حداکثر همپوشانی کاراکترها است که در هنگام تکه‌بندی بین دو بخش متن مجاور رخ می‌دهد.",
    },
  },
  vector: {
    title: "پایگاه داده برداری",
    description:
      "این‌ها اعتبارنامه‌ها و تنظیمات نحوه عملکرد نمونه AnythingLLM شما هستند. مهم است که این کلیدها به‌روز و صحیح باشند.",
    provider: {
      title: "ارائه‌دهنده پایگاه داده برداری",
      description: "برای LanceDB نیازی به پیکربندی نیست.",
    },
  },
  embeddable: {
    title: "جاسازی گفتگو",
    description:
      "جاسازی گفتگو به شما امکان می‌دهد گفتگوی فضای کاری را در وب‌سایت یا برنامه خود قرار دهید.",
    create: "ایجاد جاسازی جدید",
    table: {
      workspace: "فضای کاری",
      chats: "گفتگوهای ارسال شده",
      active: "دامنه‌های فعال",
      created: "ایجاد شده",
    },
  },
  "embed-chats": {
    title: "گفتگوهای جاسازی شده",
    export: "خروجی‌گیری",
    description:
      "این لیست تمام گفتگوها و پیام‌های ثبت شده از هر جاسازی که منتشر کرده‌اید را نشان می‌دهد.",
    table: {
      embed: "جاسازی",
      sender: "فرستنده",
      message: "پیام",
      response: "پاسخ",
      at: "زمان ارسال",
    },
  },
  event: {
    title: "گزارش رویدادها",
    description:
      "مشاهده تمام اقدامات و رویدادهای در حال وقوع در این نمونه برای نظارت.",
    clear: "پاک کردن گزارش رویدادها",
    table: {
      type: "نوع رویداد",
      user: "کاربر",
      occurred: "زمان وقوع",
    },
  },
  privacy: {
    title: "حریم خصوصی و مدیریت داده‌ها",
    description:
      "این پیکربندی شما برای نحوه مدیریت داده‌ها توسط ارائه‌دهندگان شخص ثالث متصل و AnythingLLM است.",
    llm: "انتخاب مدل زبانی",
    embedding: "ترجیحات جاسازی",
    vector: "پایگاه داده برداری",
    anonymous: "ارسال تله‌متری ناشناس فعال است",
  },
  connectors: {
    "search-placeholder": "اتصال‌دهنده‌های داده",
    "no-connectors": "هیچ اتصال داده‌ای یافت نشد.",
    github: {
      name: "ذوبان",
      description: "وارد کردن کل یک مخزن عمومی یا خصوصی در GitHub با یک کلیک.",
      URL: "آدرس مخزن GitHub",
      URL_explained:
        "آدرس مخزن GitHub که می‌خواهید از آن اطلاعات جمع‌آوری کنید.",
      token: "توکن دسترسی به گیت‌هاب",
      optional: "اختیاری",
      token_explained: "توکن دسترسی برای جلوگیری از محدودیت سرعت.",
      token_explained_start: "بدون",
      token_explained_link1: "توکن دسترسی شخصی",
      token_explained_middle:
        "، به دلیل محدودیت‌های سرعت، ممکن است API GitHub تعداد فایل‌هایی که می‌توان جمع‌آوری کرد را محدود کند. شما می‌توانید",
      token_explained_link2: "ایجاد یک توکن دسترسی موقت",
      token_explained_end: "برای جلوگیری از این مشکل.",
      ignores: "فایل را نادیده بگیرید",
      git_ignore:
        "فایل را در فرمت .gitignore برای نادیده گرفتن فایل‌های خاص در حین جمع‌آوری، وارد کنید. پس از هر ورودی که می‌خواهید ذخیره کنید، کلید Enter را فشار دهید.",
      task_explained:
        "پس از اتمام، تمام فایل‌ها برای درج در محیط‌های کاری در انتخاب‌گر اسناد در دسترس خواهند بود.",
      branch: "دایرکتی که می‌خواهید فایل‌ها را از آن دریافت کنید.",
      branch_loading: "-- بارگذاری شاخ‌های موجود --",
      branch_explained: "دایرتی که می‌خواهید فایل‌ها را از آن دریافت کنید.",
      token_information:
        "با وارد نکردن **توکن دسترسی GitHub**، این اتصال داده فقط می‌تواند فایل‌های سطح بالایی از مخزن را جمع‌آوری کند، به دلیل محدودیت‌های نرخ دسترسی API عمومی GitHub.",
      token_personal:
        "با داشتن یک حساب کاربری در GitHub، می‌توانید یک توکن دسترسی شخصی رایگان دریافت کنید.",
    },
    gitlab: {
      name: "ذخیره GitLab",
      description: "وارد کردن کل یک مخزن عمومی یا خصوصی GitLab با یک کلیک.",
      URL: "آدرس مخزن GitLab",
      URL_explained:
        "آدرس مخزن GitLab که می‌خواهید از آن اطلاعات جمع‌آوری کنید.",
      token: "توکن دسترسی GitLab",
      optional: "اختیاری",
      token_explained: "توکنی برای جلوگیری از محدودیت سرعت.",
      token_description:
        "برای دریافت اطلاعات از API GitLab، موجودیت‌های اضافی را انتخاب کنید.",
      token_explained_start: "بدون",
      token_explained_link1: "توکن دسترسی شخصی",
      token_explained_middle:
        "، API گیت‌لاب ممکن است به دلیل محدودیت‌های سرعت، تعداد فایل‌هایی که می‌توان جمع‌آوری کرد را محدود کند. شما می‌توانید",
      token_explained_link2: "ایجاد یک توکن دسترسی موقت",
      token_explained_end: "برای جلوگیری از این مشکل.",
      fetch_issues: "استخراج مسائل به صورت اسناد",
      ignores: "فایل را نادیده بگیرید",
      git_ignore:
        "فایل را در فرمت .gitignore برای نادیده گرفتن فایل‌های خاص در حین جمع‌آوری، وارد کنید. پس از هر ورودی که می‌خواهید ذخیره کنید، کلید Enter را فشار دهید.",
      task_explained:
        "پس از اتمام، تمام فایل‌ها برای قرار دادن در محیط‌های کاری در انتخاب‌گر فایل‌ها در دسترس خواهند بود.",
      branch: "دایرتی که می‌خواهید فایل‌ها را از آن دریافت کنید",
      branch_loading: "-- بارگذاری شاخ‌های موجود --",
      branch_explained: "دایرکتی که می‌خواهید فایل‌ها را از آن دریافت کنید.",
      token_information:
        "با عدم وارد کردن **توکن دسترسی GitLab**، این اتصال داده تنها قادر به جمع‌آوری **فایل‌های سطح اول** مخزن خواهد بود، به دلیل محدودیت‌های نرخ دسترسی API عمومی GitLab.",
      token_personal:
        "با داشتن یک حساب کاربری در GitLab، می‌توانید یک توکن دسترسی شخصی رایگان دریافت کنید.",
    },
    youtube: {
      name: "اسکریپت یوتیوب",
      description: "وارد کردن متن یک ویدیو کامل از یوتیوب از طریق یک لینک.",
      URL: "لینک ویدیو در یوتیوب",
      URL_explained_start:
        "برای دریافت زیرنویس هر ویدیوی یوتیوب، آدرس URL آن را وارد کنید. ویدیوی مورد نظر باید دارای",
      URL_explained_link: "زیرنویس",
      URL_explained_end: "در دسترس است.",
      task_explained:
        "پس از اتمام، این متن می‌تواند در ابزارهای کاری مختلف، از طریق انتخاب فایل، قرار داده شود.",
      language: "ترجمه زبان",
      language_explained: "زبان مورد نظر برای جمع‌آوری متن را انتخاب کنید.",
      loading_languages: "-- زبان‌های موجود را بارگذاری می‌کنیم --",
    },
    "website-depth": {
      name: "ابزار جمع‌آوری لینک‌های حجمی",
      description:
        "استخراج محتوای یک وب‌سایت و لینک‌های فرعی آن تا یک سطح مشخص.",
      URL: "آدرس وب‌سایت",
      URL_explained: "آدرس وب‌سایتی که می‌خواهید اطلاعات آن را استخراج کنید.",
      depth: "عمق خزیدن",
      depth_explained:
        "این تعداد، تعداد لینک‌های مربوط به کودکان است که کارگر باید از آدرس اصلی دنبال کند.",
      max_pages: "صفحات بیشتر",
      max_pages_explained: "حداکثر تعداد لینک‌هایی که باید جمع‌آوری شوند.",
      task_explained:
        "پس از اتمام، تمام محتوای جمع‌آوری‌شده در دسترس خواهد بود تا بتوان آن را در برنامه‌های کاری (یا فضاهای کاری) از طریق انتخاب اسناد، وارد کرد.",
    },
    confluence: {
      name: "همگرایی",
      description: "با یک کلیک، کل صفحه Confluence را وارد کنید.",
      deployment_type: "نوع استقرار:",
      deployment_type_explained:
        "لطفاً مشخص کنید که آیا نمونه‌ی Atlassian شما در فضای ابری Atlassian یا در سرور خود میزبانی می‌شود.",
      base_url: "آدرس پایه برای confluence",
      base_url_explained: "این آدرس پایه برای فضای Confluence شما است.",
      space_key: 'کلید فضای "کانفلوانس"',
      space_key_explained:
        "این کلید فضایی مربوط به نمونه‌ی confluence شما است که برای استفاده خواهد شد. معمولاً با ~ شروع می‌شود.",
      username: "نام کاربری confluent",
      username_explained: "نام کاربری شما در Confluence",
      auth_type: "نوع احراز هویت: Confluence",
      auth_type_explained:
        "نوع احراز هویت مورد نظر خود را برای دسترسی به صفحات Confluence انتخاب کنید.",
      auth_type_username: "نام کاربری و توکن دسترسی",
      auth_type_personal: "توکن دسترسی شخصی",
      token: "توکن دسترسی به confluent",
      token_explained_start:
        "شما باید یک توکن دسترسی برای احراز هویت ارائه دهید. شما می‌توانید یک توکن دسترسی ایجاد کنید.",
      token_explained_link: "اینجا",
      token_desc: "توکنی برای احراز هویت",
      pat_token: "توکن دسترسی شخصی confluence",
      pat_token_explained: "توکن دسترسی شخصی شما در Confluence.",
      task_explained:
        "پس از اتمام، محتوای صفحه برای درج در فضاهای کاری در ابزار انتخاب اسناد در دسترس خواهد بود.",
      bypass_ssl: "عدم اعتبار سنجی گواهی SSL",
      bypass_ssl_explained:
        "برای دور زدن اعتبار سنجی گواهی SSL در نمونه‌های خود میزبانی شده confluence با استفاده از گواهی امضا شده توسط خود، این گزینه را فعال کنید.",
    },
    manage: {
      documents: "اسناد",
      "data-connectors": "اتصال‌دهنده‌ها",
      "desktop-only":
        "تغییر این تنظیمات تنها در دستگاه‌های دسکتاپ در دسترس است. لطفاً برای ادامه، این صفحه را در دستگاه دسکتاپ خود باز کنید.",
      dismiss: "<",
      editing: "ویرایش",
    },
    directory: {
      "my-documents": "اسناد من",
      "new-folder": "فোলدر جدید",
      "search-document": "جستجو در مستند",
      "no-documents": "بدون مدارک",
      "move-workspace": "رفتن به فضای کاری",
      name: "نام",
      "delete-confirmation":
        "آیا مطمئن هستید که می‌خواهید این فایل‌ها و پوشه‌ها را حذف کنید؟\nاین کار باعث حذف فایل‌ها از سیستم و حذف خودکار آن‌ها از هر فضای کاری موجود می‌شود.\nاین اقدام غیرقابل بازگشت است.",
      "removing-message":
        "حذف {{count}} سند و {{folderCount}} پوشه. لطفاً منتظر بمانید.",
      "move-success": "انتقال موفقیت‌آمیز {{count}} سند.",
      date: "تاریخ",
      type: "نوع",
      no_docs: "بدون مدارک",
      select_all: "انتخاب همه",
      deselect_all: "انتخاب همه را لغو کنید",
      remove_selected: "حذف انتخاب‌شده",
      costs: "*هزینه یکباره برای ایجاد مدل‌های برداری",
      save_embed: "ذخیره و وارد کردن",
    },
    upload: {
      "processor-offline":
        "دسترسی به سیستم پردازش اسناد غیر ممکن است.\n\nدسترسی به سیستم پردازش اسناد غیر ممکن است.",
      "processor-offline-desc":
        "ما نمی‌توانیم فایل‌های شما را در حال حاضر آپلود کنیم، زیرا پردازشگر اسناد غیرفعال است. لطفاً بعداً دوباره امتحان کنید.",
      "click-upload":
        "برای بارگذاری، روی آن کلیک کنید یا از طریق کشیدن و رها کردن",
      "file-types":
        "پشتیبانی از فایل‌های متنی، CSV، صفحات گسترده، فایل‌های صوتی و موارد دیگر!",
      "or-submit-link": "یا یک لینک ارسال کنید",
      "placeholder-link": "https://example.com",
      fetching: "در حال دریافت...",
      "fetch-website": "دسترسی به وب‌سایت",
      "privacy-notice":
        "این فایل‌ها در پردازشگر اسناد که روی این نمونه از AnythingLLM در حال اجرا است، بارگذاری خواهند شد. این فایل‌ها به هیچ شخص ثالثی ارسال یا به اشتراک گذاشته نمی‌شوند.",
    },
    pinning: {
      what_pinning: "مخزن کردن اسناد چیست؟",
      pin_explained_block1:
        'هنگامی که شما یک سند را در AnythingLLM "فیکس" می‌کنید، محتوای کامل سند را در پنجره دستورالعمل برای مدل زبان بزرگ شما قرار می‌دهیم تا مدل بتواند به طور کامل آن را درک کند.',
      pin_explained_block2:
        "این روش بهترین نتیجه را با مدل‌هایی که دارای **زمینه وسیع** هستند یا فایل‌های کوچک و مهم که برای پایگاه دانش آن ضروری هستند، ارائه می‌دهد.",
      pin_explained_block3:
        "اگر به پاسخ‌های مورد نظر خود از AnythingLLM به طور پیش‌فرض دریافت نمی‌کنید، «پین کردن» یک راه عالی برای دریافت پاسخ‌های با کیفیت بالاتر در یک مرحله است.",
      accept: "باشه، متوجه شدم.",
    },
    watching: {
      what_watching: "تماشای یک مستند چه تاثیری دارد؟",
      watch_explained_block1:
        "هنگام مشاهده یک سند در AnythingLLM، محتوای سند به طور خودکار از منبع اصلی آن، در فواصل زمانی منظم، همگام‌سازی می‌شود. این کار، به‌طور خودکار محتوا را در هر فضای کاری که این فایل در آن مدیریت می‌شود، به‌روز می‌کند.",
      watch_explained_block2:
        "این ویژگی در حال حاضر از محتوای مبتنی بر اینترنت پشتیبانی می‌کند و برای اسناد ارسالی به صورت دستی در دسترس نخواهد بود.",
      watch_explained_block3_start:
        "می‌توانید تعیین کنید که کدام اسناد باید مشاهده شوند، از طریق",
      watch_explained_block3_link: "مدیریت فایل",
      watch_explained_block3_end: "مدیریت دیدگاه.",
      accept: "باشه، متوجه شدم.",
    },
    obsidian: {
      name: "آوبیشین",
      description: "وارد کردن دیسک Obsidian با یک کلیک.",
      vault_location: "موقعیت گاوصندوق",
      vault_description:
        'برای وارد کردن تمام یادداشت‌ها و ارتباطات آن‌ها، پوشه مربوط به "Obsidian" خود را انتخاب کنید.',
      selected_files: "کشف {{count}} فایل Markdown",
      importing: "وارد کردن کپسول...",
      import_vault: "وارد کردن از بایوت",
      processing_time: "این ممکن است بسته به اندازه خزانه شما، مدتی طول بکشد.",
      vault_warning:
        "برای جلوگیری از هرگونه اختلاف، مطمئن شوید که دیسک Obsidian شما در حال حاضر بسته است.",
    },
  },
  chat_window: {
    welcome: "به فضای کاری جدید خود خوش آمدید.",
    get_started: "برای شروع، می‌توانید",
    get_started_default: "برای شروع",
    upload: "ارسال یک سند",
    or: "یا",
    send_chat: "ارسال یک پیام چت.",
    send_message: "یک پیام ارسال کنید",
    attach_file: "لطفاً یک فایل را به این چت پیوست کنید.",
    slash: "برای مشاهده تمام دستورات Slash موجود برای چت.",
    agents:
      "تمام عوامل موجود را که می‌توانید برای گفتگو استفاده کنید، مشاهده کنید.",
    text_size: "تغییر اندازه متن.",
    microphone: "سوال خود را بپرسید.",
    send: "پیام فوری را برای فضای کاری ارسال کنید",
    attachments_processing: "در حال پردازش پیوست‌ها. لطفاً منتظر بمانید...",
    tts_speak_message: "پیام TTS Speak",
    copy: "کپی",
    regenerate: "بازسازی",
    regenerate_response: "بازسازی پاسخ",
    good_response: "پاسخ خوب",
    more_actions: "اقدامات بیشتر",
    hide_citations: "پنهان کردن ارجاعات",
    show_citations: "نمایش ارجاعات",
    pause_tts_speech_message: "مکالمه را متوقف کنید",
    fork: "چنگال",
    delete: "حذف",
    save_submit: "ذخیره و ارسال",
    cancel: "ยกد",
    edit_prompt: "لطفاً دستور ویرایش را ارائه دهید.",
    edit_response: "لطفا پاسخ را ویرایش کنید.",
    at_agent: "@agent",
    default_agent_description: "- عامل پیش‌فرض برای این فضای کاری.",
    custom_agents_coming_soon: "نمایندگان ویژه در حال آمدن هستند!",
    slash_reset: "/reset",
    preset_reset_description: "حذف تاریخچه چت خود و شروع یک چت جدید",
    add_new_preset: "اضافه کردن تنظیمات پیش‌فرض جدید",
    command: "دستورالعمل",
    your_command: "دستور شما",
    placeholder_prompt:
      "این محتوایی است که در ابتدای درخواست شما قرار خواهد گرفت.",
    description: "توضیحات",
    placeholder_description: "با شعر درباره مدل‌های زبانی بزرگ پاسخ می‌دهد.",
    save: "ذخیره",
    small: "کوچک",
    normal: "عادی",
    large: "بزرگ",
    workspace_llm_manager: {
      search: "پیدا کردن ارائه‌دهندگان مدل‌های زبانی بزرگ (LLM)",
      loading_workspace_settings: "بارگذاری تنظیمات فضای کاری...",
      available_models: "مدل‌های موجود برای {{provider}}",
      available_models_description:
        "یک مدل را برای استفاده در این محیط کاری انتخاب کنید.",
      save: "از این مدل استفاده کنید.",
      saving: "تنظیم مدل به عنوان پیش‌فرض فضای کاری...",
      missing_credentials: "این ارائه دهنده فاقد مدارک لازم است!",
      missing_credentials_description:
        "برای تنظیم اعتبارها، اینجا را کلیک کنید",
    },
  },
  profile_settings: {
    edit_account: "ویرایش حساب",
    profile_picture: "تصویر پروفایل",
    remove_profile_picture: "حذف تصویر پروفایل",
    username: "نام کاربری",
    new_password: "رمز عبور جدید",
    password_description: "رمز عبور باید حداقل 8 کاراکتر طول داشته باشد.",
    cancel: "ยกد",
    update_account: "به‌روزرسانی حساب",
    theme: "ترجیحات موضوعی",
    language: "زبان ترجیحی",
    failed_upload: "عدم امکان بارگذاری تصویر پروفایل: {{error}}",
    upload_success: "تصویر پروفایل آپلود شد.",
    failed_remove: "عدم امکان حذف تصویر پروفایل: {{error}}",
    profile_updated: "صفحه به‌روز شد.",
    failed_update_user: "عدم به‌روزرسانی کاربر: {{error}}",
    account: "حساب",
    support: "حمایت",
    signout: "خروج",
  },
  customization: {
    interface: {
      title: "تنظیمات رابط کاربری",
      description: "تنظیمات رابط کاربری خود را برای AnythingLLM تعیین کنید.",
    },
    branding: {
      title: "برندسازی و ارائه خدمات با برچسب سفید",
      description:
        "با استفاده از برندسازی سفارشی، نمونه‌ی AnythingLLM خود را با برچسب سفید (White-label) ارائه دهید.",
    },
    chat: {
      title: "چت",
      description: "تنظیم ترجیحات چت خود برای AnythingLLM.",
      auto_submit: {
        title: "وارد کردن خودکار گفتار",
        description: "ارسال خودکار ورودی گفتار پس از یک دوره سکوت",
      },
      auto_speak: {
        title: "پاسخ‌های خودکار",
        description: "پاسخ‌های خودکار تولید شده توسط هوش مصنوعی",
      },
      spellcheck: {
        title: "فعال کردن بررسی املایی",
        description: "فعال یا غیرفعال کردن بررسی املایی در فیلد ورودی چت",
      },
    },
    items: {
      theme: {
        title: "موضوع",
        description: "رنگ مورد علاقه خود را برای برنامه انتخاب کنید.",
      },
      "show-scrollbar": {
        title: "نمایش نوار پیمایش",
        description: "فعال یا غیرفعال کردن نوار پیمایش در پنجره چت.",
      },
      "support-email": {
        title: "پشتیبانی از طریق ایمیل",
        description:
          "آدرس ایمیل پشتیبانی را تعیین کنید که کاربران در صورت نیاز به کمک، می‌توانند از آن استفاده کنند.",
      },
      "app-name": {
        title: "نام",
        description: "یک نام را برای تمام کاربران در صفحه ورود مشخص کنید.",
      },
      "chat-message-alignment": {
        title: "همراه‌بودن پیام‌ها در چت",
        description:
          "هنگام استفاده از رابط چت، حالت هم‌تراز کردن پیام را انتخاب کنید.",
      },
      "display-language": {
        title: "زبان نمایش",
        description:
          "زبان مورد نظر برای نمایش رابط کاربری AnythingLLM را انتخاب کنید - در صورت وجود ترجمه‌ها.",
      },
      logo: {
        title: "لوگوی برند",
        description:
          "لوگوی سفارشی خود را برای نمایش در تمام صفحات بارگذاری کنید.",
        add: "اضافه کردن یک لوگوی سفارشی",
        recommended: "اندازه پیشنهادی: 800 در 200",
        remove: "حذف",
        replace: "جایگزین کردن",
      },
      "welcome-messages": {
        title: "پیام‌های خوش‌آمد",
        description:
          "پیام‌های خوش‌آمدی که به کاربران نمایش داده می‌شوند را سفارشی کنید. فقط کاربران غیر از مدیران این پیام‌ها را مشاهده خواهند کرد.",
        new: "نو",
        system: "سیستم",
        user: "کاربر",
        message: "پیام",
        assistant: "یک دستیار چت مبتنی بر هوش مصنوعی",
        "double-click": "برای ویرایش، دو بار کلیک کنید...",
        save: "ذخیره پیام‌ها",
      },
      "browser-appearance": {
        title: "ظاهر مرورگر",
        description:
          "ظاهر تب و عنوان مرورگر را هنگام باز بودن برنامه، سفارشی کنید.",
        tab: {
          title: "عنوان",
          description:
            "هنگام باز شدن برنامه در یک مرورگر، یک عنوان سفارشی برای تب تنظیم کنید.",
        },
        favicon: {
          title: "آیکون Favicon",
          description: "از آیکون سفارشی برای تب مرورگر استفاده کنید.",
        },
      },
      "sidebar-footer": {
        title: "عناصر پایینی نوار کناری",
        description: "تنظیم عناصر پاورهای نمایش داده شده در پایین بخش کناری.",
        icon: "آیکون",
        link: "لینک",
      },
      "render-html": {
        title: "نمایش کد HTML در چت",
        description:
          "ارائه پاسخ‌های HTML در پاسخ‌های دستی.\nاین می‌تواند منجر به کیفیت پاسخ با سطح دقت بسیار بالاتر شود، اما همچنین می‌تواند خطرات امنیتی بالقوه‌ای را به همراه داشته باشد.",
      },
    },
  },
  "main-page": {
    noWorkspaceError: "لطفاً قبل از شروع گفتگو، یک فضای کاری ایجاد کنید.",
    checklist: {
      title: "شروع کار",
      tasksLeft: "وظایف باقی‌مانده",
      completed:
        "شما در مسیر تبدیل شدن به یک متخصص در زمینه مدل‌های LLM هستید!",
      dismiss: "بستن",
      tasks: {
        create_workspace: {
          title: "ایجاد یک فضای کاری",
          description: "برای شروع، فضای کاری خود را ایجاد کنید",
          action: "ایجاد",
        },
        send_chat: {
          title: "ارسال یک پیام چت",
          description: "با دستیار هوش مصنوعی خود صحبت کنید",
          action: "چت",
        },
        embed_document: {
          title: "ذخیره یک سند",
          description: "اضافه کردن اولین سند خود به فضای کاری",
          action: "قرار دادن",
        },
        setup_system_prompt: {
          title: "یک سیستم راهنما راه‌اندازی کنید.",
          description: "تنظیم رفتار دستیار هوش مصنوعی خود",
          action: "راه‌اندازی",
        },
        define_slash_command: {
          title: "یک دستور (slash command) را تعریف کنید.",
          description: "ایجاد دستورات سفارشی برای دستیار خود",
          action: "تعریف کنید",
        },
        visit_community: {
          title: "بازدید از مرکز محلی",
          description: "بررسی منابع و الگوهای موجود در جامعه",
          action: "مرور کنید",
        },
      },
    },
    quickLinks: {
      title: "لینک‌های سریع",
      sendChat: "ارسال چت",
      embedDocument: "ذخیره یک سند",
      createWorkspace: "ایجاد فضای کاری",
    },
    exploreMore: {
      title: "ویژگی‌های بیشتر را کشف کنید",
      features: {
        customAgents: {
          title: "آژانتهای هوش مصنوعی سفارشی",
          description:
            "ایجاد عوامل هوش مصنوعی و اتوماسیون قدرتمند بدون نیاز به کد.",
          primaryAction: "با استفاده از @agent\n\nبا استفاده از @agent",
          secondaryAction: "طراحی یک جریان برای یک عامل",
        },
        slashCommands: {
          title: "دستورات کوتاه",
          description:
            "با استفاده از دستورات سفارشی، زمان را صرفه‌جویی کنید و اعلان‌ها را فعال کنید.",
          primaryAction: "ایجاد یک دستور Slash",
          secondaryAction: "کاوش در هاب",
        },
        systemPrompts: {
          title: "دستورالعمل‌های سیستم",
          description:
            "برای سفارشی‌سازی پاسخ‌های هوش مصنوعی در یک محیط کاری، دستورالعمل سیستم را تغییر دهید.",
          primaryAction: "تغییر یک دستورالعمل سیستم",
          secondaryAction: "مدیریت متغیرهای پویا",
        },
      },
    },
    announcements: {
      title: "اخبار و اطلاعیه‌ها",
    },
    resources: {
      title: "منابع",
      links: {
        docs: "اسناد",
        star: "ستاره‌گذاری در گیت‌هاب",
      },
      keyboardShortcuts: "کلیدهای میانبر",
    },
  },
  "keyboard-shortcuts": {
    title: "کلیدهای میانبر",
    shortcuts: {
      settings: "تنظیمات را باز کنید",
      workspaceSettings: "تنظیمات فضای کاری فعلی را باز کنید",
      home: "بازگشت به صفحه اصلی",
      workspaces: "مدیریت فضاهای کاری",
      apiKeys: "تنظیمات کلیدهای API",
      llmPreferences: "ترجیحات مدل‌های زبان بزرگ",
      chatSettings: "تنظیمات چت",
      help: "راهنمای کلیدهای میانبر",
      showLLMSelector: "انتخاب فضای کاری برای مدل‌های زبانی بزرگ",
    },
  },
  community_hub: {
    publish: {
      system_prompt: {
        success_title: "موفقیت!",
        success_description: 'پیام شما در بخش "انجمن" منتشر شده است!',
        success_thank_you: "از اینکه با جامعه به اشتراک گذاشتید، سپاسگزاریم!",
        view_on_hub: "مشاهده در مرکز جامعه",
        modal_title: "دستورالعمل انتشار",
        name_label: "نام",
        name_description: "این نام نمایش برای سیستم شما است.",
        name_placeholder: "دستورالعمل سیستم من",
        description_label: "توضیحات",
        description_description:
          "این، توضیحی برای دستورالعمل سیستم شما است. از این برای توضیح هدف دستورالعمل سیستم خود استفاده کنید.",
        tags_label: "برچسب‌ها",
        tags_description:
          "برچسب‌ها برای شناسایی و جستجوی آسان‌تر دستورالعمل‌های سیستم استفاده می‌شوند. شما می‌توانید چندین برچسب را اضافه کنید. حداکثر 5 برچسب. حداکثر 20 کاراکتر برای هر برچسب.",
        tags_placeholder:
          "برای افزودن برچسب‌ها، نوع را وارد کنید و Enter را بزنید.",
        visibility_label: "دیده‌شدن",
        public_description: "پیام‌های عمومی در دسترس همه افراد قرار دارند.",
        private_description: "پیام‌های خصوصی فقط برای شما قابل مشاهده هستند.",
        publish_button: "انتشار در مرکز جامعه",
        submitting: "انتشار...",
        submit: "انتشار در مرکز جامعه",
        prompt_label: "شروع",
        prompt_description:
          "این دستورالعمل اصلی است که برای هدایت مدل زبان بزرگ (LLM) استفاده خواهد شد.",
        prompt_placeholder: "لطفاً دستور خود را در اینجا وارد کنید...",
      },
      agent_flow: {
        public_description:
          "دسترسی به جریان‌های اطلاعاتی برای عموم مردم امکان‌پذیر است.",
        private_description:
          "فقط شما می‌توانید جریان‌های مربوط به نمایندگان خصوصی را مشاهده کنید.",
        success_title: "موفقیت!",
        success_description:
          'پلتفرم "Agent Flow" شما در مرکز جامعه منتشر شده است!',
        success_thank_you: "از اینکه با جامعه به اشتراک گذاشتید، سپاسگزاریم!",
        view_on_hub: "مشاهده در مرکز جامعه",
        modal_title: "آژانس انتشار",
        name_label: "نام",
        name_description: "این نام نمایش برای جریان کاری شما است.",
        name_placeholder: "آژانس من",
        description_label: "توضیحات",
        description_description:
          "این، شرح جریان کاری شما است. از این برای توضیح هدف جریان کاری خود استفاده کنید.",
        tags_label: "برچسب‌ها",
        tags_description:
          "برچسب‌ها برای شناسایی و سازماندهی جریان‌های کاری خود به منظور جستجوی آسان‌تر استفاده می‌شوند. شما می‌توانید چندین برچسب را اضافه کنید. حداکثر 5 برچسب. حداکثر 20 کاراکتر برای هر برچسب.",
        tags_placeholder:
          "برای افزودن برچسب‌ها، نوع را وارد کنید و Enter را فشار دهید.",
        visibility_label: "دیده‌شدن",
        publish_button: "انتشار در مرکز جامعه",
        submitting: "انتشار...",
        submit: "انتشار در مرکز جامعه",
        privacy_note:
          "جریان‌ها همیشه به صورت خصوصی بارگذاری می‌شوند تا از هرگونه اطلاعات حساس محافظت شود. شما می‌توانید پس از انتشار، قابلیت مشاهده را در مرکز جامعه تغییر دهید. لطفاً قبل از انتشار، از این نکته اطمینان حاصل کنید که جریان شما حاوی هیچ اطلاعات حساس یا خصوصی نیست.",
      },
      generic: {
        unauthenticated: {
          title: "احراز هویت الزامی است",
          description:
            "شما باید قبل از انتشار مطالب، با مرکز جامعه AnythingLLM احراز هویت کنید.",
          button: "اتصال به مرکز جامعه",
        },
      },
      slash_command: {
        success_title: "موفقیت!",
        success_description: "دستور Slash شما در مرکز جامعه منتشر شده است!",
        success_thank_you: "از اینکه با جامعه به اشتراک گذاشتید، سپاسگزاریم!",
        view_on_hub: "مشاهده در مرکز جامعه",
        modal_title: "انتشار دستور Slash",
        name_label: "نام",
        name_description: "این نام نمایش برای دستورslash شما است.",
        name_placeholder: "دستور Slash من",
        description_label: "توضیحات",
        description_description:
          "این، توضیحی برای دستور slash شما است. از این برای توضیح هدف دستور slash خود استفاده کنید.",
        command_label: "دستورالعمل",
        command_description:
          "این دستور، همان کدی است که کاربران برای فعال کردن این تنظیمات از آن استفاده می‌کنند.",
        command_placeholder: "دستور من",
        tags_label: "برچسب‌ها",
        tags_description:
          "برچسب‌ها برای شناسایی دستورات Slash Command به منظور جستجوی آسان‌تر استفاده می‌شوند. شما می‌توانید چندین برچسب را اضافه کنید. حداکثر 5 برچسب. حداکثر 20 کاراکتر برای هر برچسب.",
        tags_placeholder:
          "برای افزودن برچسب‌ها، نوع را وارد کنید و Enter را بزنید.",
        visibility_label: "دیده‌شدن",
        public_description: "دستورات عمومی در دسترس همه کاربران است.",
        private_description: "دستورات خصوصی فقط برای شما قابل مشاهده هستند.",
        publish_button: "انتشار در مرکز جامعه",
        submitting: "انتشار...",
        prompt_label: "شروع",
        prompt_description:
          "این دستور، زمانی استفاده می‌شود که دستور با خط (slash command) فعال شود.",
        prompt_placeholder: "لطفاً درخواست خود را در اینجا وارد کنید...",
      },
    },
  },
  security: {
    title: "امنیت",
    multiuser: {
      title: "حالت چند کاربره",
      description:
        "نمونه خود را برای پشتیبانی از تیم خود با فعال‌سازی حالت چند کاربره تنظیم کنید.",
      enable: {
        "is-enable": "حالت چند کاربره فعال است",
        enable: "فعال‌سازی حالت چند کاربره",
        description:
          "به طور پیش‌فرض، شما تنها مدیر خواهید بود. به عنوان مدیر، باید برای تمام کاربران یا مدیران جدید حساب کاربری ایجاد کنید. رمز عبور خود را گم نکنید زیرا فقط یک کاربر مدیر می‌تواند رمزهای عبور را بازنشانی کند.",
        username: "نام کاربری حساب مدیر",
        password: "رمز عبور حساب مدیر",
      },
    },
    password: {
      title: "حفاظت با رمز عبور",
      description:
        "از نمونه AnythingLLM خود با رمز عبور محافظت کنید. اگر این رمز را فراموش کنید هیچ روش بازیابی وجود ندارد، پس حتماً این رمز عبور را ذخیره کنید.",
      "password-label": "رمز عبور نمونه",
    },
  },
  home: {
    welcome: "خوش آمدید",
    chooseWorkspace: "انتخاب یک فضای کار برای شروع گفتگو!",
    notAssigned:
      "شما در حال حاضر به هیچ فضای کاری اختصاص نیافته‌اید.\nلطفاً با مدیر خود تماس بگیرید تا دسترسی به یک فضای کار را درخواست کنید.",
    goToWorkspace: 'به فضای کار "{{workspace}}" بروید',
  },
};

export default TRANSLATIONS;
