// Anything with "null" requires a translation. Contribute to translation via a PR!
const TRANSLATIONS = {
  onboarding: {
    home: {
      title: "مرحبا في",
      getStarted: "بسم الله",
    },
    llm: {
      title: "إعدادات نموذج التعلم العميق المفضّلة",
      description:
        "يمكن لـِ  إيني ثينك إلْلْمْ العمل مع عدة موفرين لنماذج التعلم العميق لأداء خدمة المحادثات",
    },
    userSetup: {
      title: "إنشاء المستعمِل",
      description: ".ضبط إعدادات مستعمِلِك",
      howManyUsers: "كم من مستعمِل سيستعمِل هذا المثيل ؟",
      justMe: "فقط أنا",
      myTeam: "فريقي",
      instancePassword: "كلمة مرورالمثيل",
      setPassword: "هل تريد إنشاء كلمة مرور ؟",
      passwordReq: "يجب أن تحتوي كلمة المرور على ثمانية حروف على الأقل",
      passwordWarn: "من المهم حفظ كلمة المرور هذه لأنه لا يمكن استردادها.",
      adminUsername: "اسم مستعمل حساب المشرف",
      adminPassword: "كلمة مرور حساب المشرف",
      adminPasswordReq: "يجب أن تكون كلمات المرور 8 أحرف على الأقل.",
      teamHint:
        "بمجرد اكتمال الإنشاء  ستكون المشرف الوحيد يمكنك دعوة الآخرين ليكونوا مستعملين أو مشرفين. لا تفقد كلمة المرور الخاصة بك حيث يمكن للمشرفين فقط إعادة تعيين كلمات المرور",
    },
    data: {
      title: "معالجة البيانات والخصوصية",
      description:
        "نحن ملتزمون بالشفافية والمراقبة عندما يتعلق الأمر ببياناتك الشخصية.",
      settingsHint: "يمكن إعادة ضبط هذه الإعدادات في أي وقت.",
    },
    survey: {
      title: "مرحباً في إيني ثينك إلْلْمْ",
      description:
        " بما يتناسب مع احتياجاتك ساعدنا إذا أحببت في تصميم  إيني ثينك إلْلْمْ",
      email: "ما هو بريدك الالكتروني؟",
      useCase: "لماذا ستستخدم إيني ثينك إلْلْمْ؟",
      useCaseWork: "للعمل",
      useCasePersonal: "للاستخدام الشخصي",
      useCaseOther: "شيء آخَر",
      comment: "كيف سمعت عن إيني ثينك إلْلْمْ ؟",
      commentPlaceholder:
        "أخبرنا كيف وجدتنا!، يوتيوب، تويتر، جيثوب، ريديت وما إلى ذلك -",
      skip: "تخطي الاستطلاع",
      thankYou: "شكرا على تقييماتك!",
    },
    workspace: {
      title: "قم بإنشاء مساحة العمل الأولى الخاصة بك",
      description:
        "قم بإنشاء مساحة العمل الأولى الخاصة بك وابدأ مع إيني ثينك إلْلْمْ.",
    },
  },
  common: {
    "workspaces-name": "اسم مساحة العمل",
    error: "خطأ",
    success: "موفّق",
    user: "مستعمِل",
    selection: "اختيار النموذج",
    saving: "حفظ...",
    save: "حفظ التغييرات",
    previous: "الصفحة السابقة",
    next: "الصفحة التالية",
    optional: "اختياري",
    yes: "نعم",
    no: "لا",
    search: "بحث",
    username_requirements:
      "يجب أن يتكون اسم المستخدم من 2 إلى 32 حرفًا، ويبدأ بحرف صغير، ويحتوي فقط على حروف وأرقام وعلامات التسطير والنقاط.",
  },
  settings: {
    title: "إعدادات المثيل",
    system: "الإعدادات العامة",
    invites: "دعوات",
    users: "مستعملون",
    workspaces: "مساحات العمل",
    "workspace-chats": "محادثات مساحة العمل",
    customization: "التخصيص",
    "api-keys": "واجهة برمجة التطبيقات للمطورين",
    llm: "النماذج اللغوية الكبيرة",
    transcription: "النسْخ",
    embedder: "مُضمّن",
    "text-splitting": "تقسيم النص تقطيعه",
    "voice-speech": "الصوت والخطاب",
    "vector-database": "قاعدة بيانات المتجهات",
    embeds: "تضمين المحادثة",
    "embed-chats": "سجل تضمين المحادثة",
    security: "حماية",
    "event-logs": "سجلات الأحداث",
    privacy: "الخصوصية والبيانات",
    "ai-providers": "موفرو الذكاء الاصطناعي",
    "agent-skills": "مهارات الوكيل",
    admin: "مشرف",
    tools: "أدوات",
    "experimental-features": "الميزات التجريبية",
    contact: "اتصل بالدعم",
    "browser-extension": "ملحق المتصفح",
    "system-prompt-variables": "متغيرات المطالبات للنظام",
    interface: "تفضيلات واجهة المستخدم",
    branding: "التسويق بالعلامة التجارية ووضع العلامات التجارية",
    chat: "دردشة",
    "mobile-app": "AnythingLLM Mobile",
  },
  login: {
    "multi-user": {
      welcome: "مرحبا في",
      "placeholder-username": "اسم المستعمِل",
      "placeholder-password": "كلمة المرور",
      login: "تسجيل الدخول",
      validating: "جاري التحقق...",
      "forgot-pass": "هل نسيت كلمة المرور",
      reset: "إعادة الضبط",
    },
    "sign-in": "تسجيل الدخول إلى حساب {{appName}}.",
    "password-reset": {
      title: "إعادة تعيين كلمة المرور",
      description:
        "قم بإدخال المعلومات اللازمة أدناه لإعادة تعيين كلمة المرور الخاصة بك.",
      "recovery-codes": "رموز الاسترداد",
      "recovery-code": " {{index}} رمز الاسترداد",
      "back-to-login": "العودة إلى تسجيل الدخول",
    },
  },
  "new-workspace": {
    title: "مساحة عمل جديدة",
    placeholder: "مساحتي للعمل",
  },
  "workspaces—settings": {
    general: "الإعدادات العامة",
    chat: "إعدادات المحادثة",
    vector: "قاعدة بيانات المتجهات",
    members: "أعضاء",
    agent: "تكوين الوكيل",
  },
  general: {
    vector: {
      title: "عدد المتجهات",
      description:
        "العدد الإجمالي للمتجهات في قاعدة بيانات المتجهات الخاصة بك.",
    },
    names: {
      description: "سيؤدي هذا فقط إلى تغيير اسم العرض لمساحة العمل الخاصة بك.",
    },
    message: {
      title: "رسائل المحادثة المقترحة",
      description:
        " تخصيص الرسائل التي سيتم اقتراحها لمستعملي مساحة العمل الخاصة بك.",
      add: "إضافة رسالة جديدة",
      save: "حفظ الرسائل",
      heading: "اشرح لي",
      body: "فوائد برنامج إيني ثينك إلْلْمْ",
    },
    pfp: {
      title: "صورة الملف الشخصي للمساعد",
      description: "تخصيص صورة الملف الشخصي للمساعد لمساحة العمل هذه.",
      image: "صورة مساحة العمل",
      remove: "إزالة صورة مساحة العمل",
    },
    delete: {
      title: "حذف مساحة العمل",
      description:
        "احذف مساحة العمل هذه وكل بياناتها. سيؤدي هذا إلى حذف مساحة العمل لجميع المستخدمين.",
      delete: "حذف مساحة العمل",
      deleting: "حذف مساحة العمل...",
      "confirm-start": "أنت على وشكِ حذف كامل",
      "confirm-end":
        "لمساحة العمل. سيؤدي هذا إلى إزالة جميع تضمينات المتجهات في قاعدة بيانات المتجهات الخاصة بك.\n\nستظل ملفات المصدر الأصلية دون مساس. هذا الإجراء لا رجعة فيه.",
    },
  },
  chat: {
    llm: {
      title: "موفر نموذج التعلم العميق لمساحة العمل",
      description:
        "موفر نموذج التعلم العميق المحدد والنموذج الذي سيتم استخدامه لمساحة العمل هذه. من الوهلة الأولى، يستخدم موفر نموذج التعلم العميق هذا مع إعدادات النظام.",
      search: "البحث عن كل مُوفري نماذج التعلم العميق",
    },
    model: {
      title: "نموذج محادثة مساحة العمل",
      description:
        "نموذج المحادثة المحدد الذي سيتم استخدامه لمساحة العمل هذه. إذا كان غير محدد، فسيتم استخدام نموذج التعلم العميق الافتراضي للنظام.",
      wait: "-- في انتظار النماذج --",
    },
    mode: {
      title: "وضع المحادثة",
      chat: {
        title: "المحادثة",
        "desc-start": "سيقدم إجابات حسب المعرفة العامة لنموذج التعلم العميق",
        and: "and",
        "desc-end": "المستند الذي تم العثور عليه حسب السياق.",
      },
      query: {
        title: "استعلام",
        "desc-start": "سوف تقدم الإجابات",
        only: "فقط",
        "desc-end": "إذا وجد المستند في السياق",
      },
    },
    history: {
      title: "سجل المحادثة",
      "desc-start":
        "عدد المحادثات السابقة التي سيتم تضمينها في رد الذاكرة قصيرة المدى.",
      recommend: "الموصى به 20.",
      "desc-end":
        "من المرجح أن يؤدي أي رقم أكبر من 45 إلى فشل مستمر في المحادثة اعتمادًا على حجم الرسالة.",
    },
    prompt: {
      title: "النداء",
      description:
        "النداء التي سيتم استخدامه في مساحة العمل هذه. حدد السياق والتعليمات للذكاء الاصطناعي للاستجابة. يجب عليك تقديم نداء مصمم بعناية حتى يتمكن الذكاء الاصطناعي من إنشاء استجابة دقيقة وذات صلة.",
      history: {
        title: "سجل تفاعلات النظام",
        clearAll: "مسح الكل",
        noHistory: "لا يوجد سجل تاريخي للنظام.",
        restore: "استعادة",
        delete: "حذف",
        deleteConfirm:
          "هل أنت متأكد من أنك تريد حذف هذا العنصر من سجل الأنشطة؟",
        clearAllConfirm:
          "هل أنت متأكد من أنك تريد مسح كل التاريخ؟ لا يمكن التراجع عن هذه العملية.",
        expand: "وسّع",
        publish: "نشر في مركز المجتمع",
      },
    },
    refusal: {
      title: "الرد على رفض وضعية الاستعلام",
      "desc-start": "عندما تكون في",
      query: "استعلام",
      "desc-end":
        "وضعٍية ترغب في إرجاع رفض آخر مناسب عندما لا يتم العثور على السياق.",
      "tooltip-title": "لماذا أرى هذا؟",
      "tooltip-description":
        "أنت في وضع الاستعلام، والذي يستخدم فقط المعلومات الموجودة في مستنداتك. انتقل إلى وضع الدردشة لإجراء محادثات أكثر مرونة، أو انقر هنا لزيارة وثائقنا لمعرفة المزيد عن أوضاع الدردشة.",
    },
    temperature: {
      title: "حرارة نموذج التعلم العميق",
      "desc-start":
        'يتحكم هذا الإعداد في مدى "الإبداع" الذي ستكون عليه إجابات نموذج التعلم العميق.',
      "desc-end":
        "كلما زاد العدد كلما كان الإبداع أكبر. بالنسبة لبعض النماذج، قد يؤدي هذا إلى استجابات غير منسجمة عند ضبطها على رقم مرتفع للغاية.",
      hint: "لدى معظم نماذج التعلم العميق مجالات مقبولة مختلفة من القيم الصالحة. استشر موفر نموذج التعلم العميق الخاص بك للحصول على هذه المعلومات.",
    },
  },
  "vector-workspace": {
    identifier: "معرف قاعدة بيانات المتجهة",
    snippets: {
      title: "الحد الأقصى لمقتطفات السياق",
      description:
        "يتحكم هذا الإعداد في الحد الأقصى لعدد مقتطفات السياق التي سيتم إرسالها إلى نموذج التعلم العميق لكل محادثة أو استعلام.",
      recommend: "الموصى به: 4",
    },
    doc: {
      title: "عتبة تشابه المستند",
      description:
        "الحد الأدنى لدرجة التشابه المطلوبة لاعتبار المصدر مرتبطًا بالمحادثة. وكلما زاد الرقم، كلما كان المصدر أكثر تشابهًا بالمحادثة.",
      zero: "لا قيد",
      low: "منخفضة (درجة التشابه ≥ .25)",
      medium: "متوسطة ​​(درجة التشابه ≥ .50)",
      high: "عالية (درجة التشابه ≥ .75)",
    },
    reset: {
      reset: "إعادة تعيين قاعدة بيانات المتجهات",
      resetting: "مسح المتجهات...",
      confirm:
        "أنت على وشك إعادة تعيين قاعدة بيانات المتجهات الخاصة بمساحة العمل هذه. سيؤدي هذا إلى إزالة جميع تضمينات المتجهات المضمنة حاليًا.\n\nستظل ملفات المصدر الأصلية دون مساس. هذا الإجراء لا رجعة فيه.",
      error: "تعذرت إعادة تعيين قاعدة بيانات متجهة مساحة العمل!",
      success: "تم إعادة تعيين قاعدة بيانات متجهة مساحة العمل!",
    },
  },
  agent: {
    "performance-warning":
      "يعتمد أداء نماذج التعلم العميق التي لا تدعم صراحةً استدعاء الأدوات بشكل كبير على قدرات النموذج ودقته. قد تكون بعض القدرات محدودة أو غير وظيفية.",
    provider: {
      title: "موفر نموذج التعلم العميق لوكيل مساحة العمل",
      description:
        "موفر نموذج التعلم العميق والنموذج المحدد الذي سيتم استخدامه لوكيل الخاص بمساحة العمل هذه.",
    },
    mode: {
      chat: {
        title: "نموذج محادثة وكيل مساحة العمل",
        description:
          "نموذج المحادثة المحدد الذي سيتم استخدامه لوكيل الخاص بمساحة العمل هذه.",
      },
      title: "نموذج وكيل مساحة العمل",
      description:
        "نموذج نموذج التعلم العميق المحدد الذي سيتم استخدامه لوكيل الخاص بمساحة العمل هذه.",
      wait: "-- في انتظار النماذج --",
    },
    skill: {
      title: "مهارات الوكيل الافتراضية",
      description:
        "قم بتحسين القدرات الطبيعية للوكيل الافتراضي باستخدام هذه المهارات المعدة مسبقًا. ينطبق هذا الإعداد على جميع مساحات العمل.",
      rag: {
        title: "التوليد المعزز بالاسترجاع والذاكرة طويلة المدى",
        description:
          'اسمح للوكيل بالاستفادة من مستنداتك المحلية للإجابة على استعلام أو اطلب من الوكيل "تذكر" أجزاء من المحتوى لاسترجاعها في الذاكرة طويلة المدى.',
      },
      view: {
        title: "عرض وتلخيص المستندات",
        description:
          "السماح للوكيل بإدراج وتلخيص محتوى ملفات مساحة العمل المضمنة حاليًا.",
      },
      scrape: {
        title: "جمع محتوى المواقع الإلكترونية",
        description: "السماح للوكيل بزيارة مواقع الويب وجمع محتواها.",
      },
      generate: {
        title: "إنشاء المخططات البيانية",
        description:
          "تمكين الوكيل الافتراضي لإنشاء أنواع مختلفة من المخططات من البيانات المقدمة أو المعطاة في المحادثة.",
      },
      save: {
        title: "إنشاء الملفات وحفظها في المتصفح",
        description:
          "تمكين الوكيل الافتراضي من إنشاء الملفات والكتابة عليها وحفظها و تنزيلها في متصفحك.",
      },
      web: {
        title: "البحث والتصفح المباشر على الويب",
        "desc-start":
          "قم بتمكين الوكيل الخاص بك من البحث في الويب للإجابة على أسئلتك من خلال الاتصال بموفر البحث على الويب.",
        "desc-end":
          "لن يعمل البحث على الويب أثناء حصص المحادثة بواسطة الوكيل حتى يتم إعداد ذلك.",
      },
    },
  },
  recorded: {
    title: "محادثات مساحة العمل",
    description:
      "هذه هي جميع المحادثات والرسائل المسجلة التي أرسلها المستعملون مرتبة حسب تاريخ إنشائها.",
    export: "تصدير",
    table: {
      id: "معرف",
      by: "أرسلت بواسطة",
      workspace: "مساحة العمل",
      prompt: "نداء",
      response: "استجابة",
      at: "أرسلت في",
    },
  },
  api: {
    title: " مفاتيح واجهة برمجة التطبيقات.",
    description:
      "تسمح مفاتيح واجهة برمجة التطبيقات  لحامليها بالوصول إلى مثيل إني ثينك إلْلْم هذا وإدارته برمجيًا.",
    link: "اقرأ وثائق واجهة برمجة التطبيقات .",
    generate: "إنشاء مفتاح واجهة برمجة التطبيقات الجديد",
    table: {
      key: "مفتاح واجهة برمجة التطبيقات",
      by: "تم الإنشاء بواسطة",
      created: "تم إنشاؤها",
    },
  },
  llm: {
    title: "تفضيل نموذج التعلم العميق",
    description:
      "هذه هي بيانات الاعتماد والإعدادات الخاصة بنموذج التعلم العميق للمحادثة وموفر التضمين المفضلين لديك . من المهم أن تكون هذه المفاتيح حديثة وصحيحة وإلا فلن يعمل برنامج إني ثينك إلْلْم بشكل صحيح.",
    provider: "موفر نموذج التعلم العميق",
    providers: {
      azure_openai: {
        azure_service_endpoint: "نقطة نهاية الخدمة في Azure",
        api_key: "مفتاح واجهة برمجة التطبيقات",
        chat_deployment_name: "اسم نشر الدردشة",
        chat_model_token_limit: "حدود عدد الرموز المميزة في نموذج الدردشة",
        model_type: "نوع النموذج",
        default: "افتراضي",
        reasoning: "المنطق",
        model_type_tooltip:
          'إذا كان نظامك يعتمد على نموذج استدلال (مثل o1، o1-mini، o3-mini، إلخ)، فيرجى تعيين هذا الخيار على "الاستدلال". وإلا، فقد تفشل طلبات الدردشة الخاصة بك.',
      },
    },
  },
  transcription: {
    title: "تفضيل نموذج النسخ",
    description:
      "هذه هي بيانات الاعتماد والإعدادات الخاصة بموفر نموذج النسخ المفضل لديك. من المهم أن تكون هذه المفاتيح حديثة وصحيحة وإلا فلن يتم نسخ ملفات الوسائط والصوت.",
    provider: "موفر النسخ",
    "warn-start":
      "يمكن أن يؤدي استخدام نموذج الهمس المحلي على الأجهزة ذات ذاكرة الوصول العشوائي أو وحدة المعالجة المركزية المحدودة إلى تعطيل إني ثينك إلْلْم عند معالجة ملفات الوسائط.",
    "warn-recommend":
      "نوصي بذاكرة وصول عشوائي بسعة 2 جيجابايت على الأقل وتحميل ملفات أقل من 10 ميجا بايت.",
    "warn-end": "سيتم تنزيل النموذج المدمج تلقائيًا عند الاستخدام الأول.",
  },
  embedding: {
    title: "تفضيل التضمين",
    "desc-start":
      "عند استخدام نموذج تعلم عميق لا يدعم محرك التضمين أصلاً - قد تحتاج إلى تحديد بيانات الاعتماد بالإضافة إلى ذلك لتضمين النص.",
    "desc-end":
      "التضمين هو عملية تحويل النص إلى متجهات. هذه البيانات مطلوبة لتحويل ملفاتك ومطالباتك إلى تنسيق يمكن لـ إني ثينك إلْلْمْ استخدامه للمعالجة.",
    provider: {
      title: "موفر التضمين",
    },
  },
  text: {
    title: "تقسيم النص وتفضيلات التقطيع",
    "desc-start":
      "في بعض الأحيان، قد ترغب في تغيير الطريقة الافتراضية التي يتم بها تقسيم المستندات الجديدة وتقطيعها قبل إدراجها في قاعدة بيانات المتجهة الخاصة بك.",
    "desc-end":
      "يجب عليك فقط تعديل هذا الإعداد إذا كنت تفهم كيفية عمل تقسيم النص وتأثيراته الجانبية.",
    size: {
      title: "حجم قطعة النص",
      description:
        "هذا هو الحد الأقصى لطول الأحرف التي يمكن أن تكون موجودة في متجهة واحدة.",
      recommend: "الحد الأقصى لطول نموذج التضمين هو",
    },
    overlap: {
      title: "تداخل قطعة النص",
      description:
        "هذا هو الحد الأقصى لتداخل الأحرف الذي يحدث أثناء تقطيع قطعتي نص متجاورتين.",
    },
  },
  vector: {
    title: "قاعدة بيانات المتجهة",
    description:
      "هذه هي بيانات الاعتماد والإعدادات الخاصة بكيفية عمل مثيل إني ثينك إلْلْمْ الخاص بك. من المهم أن تكون هذه المفاتيح حالية وصحيحة.",
    provider: {
      title: "موفر قاعدة بيانات المتجهة",
      description: "ليست هناك حاجة تعيين إعدادات لانسديبي .",
    },
  },
  embeddable: {
    title: "أدوات المحادثة القابلة للتضمين",
    description:
      "تعتبر أدوات المحادثة القابلة للتضمين عبارة عن واجهات محادثة عامة مرتبطة بمساحة عمل واحدة. تتيح لك هذه الأدوات إنشاء مساحات عمل يمكنك بعد ذلك نشرها .",
    create: "إنشاء تضمين",
    table: {
      workspace: "مساحة العمل",
      chats: "المحادثات المرسلة",
      active: "المجالات النشطة",
      created: "تم إنشاؤه",
    },
  },
  "embed-chats": {
    title: "تضمين المحادثات",
    export: "تصدير",
    description:
      "هذه هي جميع المحادثات والرسائل المسجلة من أي تضمين قمت بنشره.",
    table: {
      embed: "تضمين",
      sender: "مُرسِل",
      message: "رسالة",
      response: "استجابة",
      at: "أرسلت في",
    },
  },
  event: {
    title: "سجلات الحدث",
    description:
      "عرض كافة الإجراءات والأحداث التي تحدث في هذا المثيل للمراقبة.",
    clear: "محو سجلات الأحداث",
    table: {
      type: "نوع الحدث",
      user: "مستعمِل",
      occurred: "حدث في",
    },
  },
  privacy: {
    title: "الخصوصية ومعالجة البيانات",
    description:
      "هذا هو التكوين الخاص بك لكيفية تعامل موفري الطرف الثالث المتصلين و إني ثينك إلْلْمْ مع بياناتك.",
    llm: "اختيار نموذج التعلم العميق",
    embedding: "تفضيلات التضمين",
    vector: "قاعدة بيانات المتجهة",
    anonymous: "تم تمكين القياس المستتر عن بعد ",
  },
  connectors: {
    "search-placeholder": "اتصالات البيانات",
    "no-connectors": "لم يتم العثور على أي اتصالات بيانات.",
    github: {
      name: "مستودع GitHub",
      description:
        "استورد مستودع GitHub بأكمله (سواء كان عامًا أو خاصًا) بنقرة واحدة.",
      URL: "عنوان مستودع GitHub",
      URL_explained: "عنوان مستودع GitHub الذي ترغب في جمعه.",
      token: "رمز الوصول إلى GitHub",
      optional: "اختياري",
      token_explained: "رمز الوصول لمنع تحديد السرعة.",
      token_explained_start: "بدون مساعدة.",
      token_explained_link1: "رمز الوصول الشخصي",
      token_explained_middle:
        "، قد تحدد واجهة برمجة التطبيقات الخاصة بـ GitHub عدد الملفات التي يمكن جمعها بسبب قيود السرعة. يمكنك",
      token_explained_link2: "إنشاء رمز وصول مؤقت",
      token_explained_end: "لتجنب هذه المشكلة.",
      ignores: "يتجاهل الملف",
      git_ignore:
        "قم بإدراج قائمة بتنسيق .gitignore لتجاهل الملفات المحددة أثناء عملية الجمع. اضغط على مفتاح الإدخال بعد كل إدخال ترغب في حفظه.",
      task_explained:
        "بمجرد الانتهاء، ستكون جميع الملفات متاحة لإدراجها في مساحات العمل في أداة اختيار المستندات.",
      branch: "المجلد الذي ترغب في استرداد الملفات منه.",
      branch_loading: "-- تحميل الفروع المتاحة --",
      branch_explained: "المجلد الذي ترغب في استرداد الملفات منه.",
      token_information:
        "بسبب قيود معدل الوصول إلى واجهة برمجة التطبيقات العامة الخاصة بـ GitHub، لن يتمكن هذا الموصل من جمع الملفات ذات المستوى الأعلى فقط.",
      token_personal: "احصل على رمز وصول شخصي مجاني مع حساب GitHub هنا.",
    },
    gitlab: {
      name: "مستودع GitLab",
      description:
        "استورد مستودع GitLab بالكامل، سواء كان عامًا أو خاصًا، بنقرة واحدة.",
      URL: "عنوان مستودع GitLab",
      URL_explained: "عنوان مستودع GitLab الذي ترغب في جمعه.",
      token: "رمز الوصول إلى GitLab",
      optional: "اختياري",
      token_explained: "رمز الوصول لمنع تحديد السرعة.",
      token_description:
        "حدد الكيانات الإضافية التي تريد استردادها من واجهة برمجة التطبيقات الخاصة بـ GitLab.",
      token_explained_start: "بدون مساعدة.",
      token_explained_link1: "رمز الوصول الشخصي",
      token_explained_middle:
        "، قد تحدد واجهة برمجة التطبيقات الخاصة بـ GitLab عدد الملفات التي يمكن جمعها بسبب قيود السرعة. يمكنك",
      token_explained_link2: "إنشاء رمز وصول مؤقت",
      token_explained_end: "لتجنب هذه المشكلة.",
      fetch_issues: "استرجاع المشكلات بصيغة المستندات",
      ignores: "يتجاهل الملف",
      git_ignore:
        "قم بإدراج قائمة بتنسيق .gitignore لتجاهل الملفات المحددة أثناء عملية الجمع. اضغط على مفتاح الإدخال بعد كل إدخال ترغب في حفظه.",
      task_explained:
        "بمجرد الانتهاء، ستكون جميع الملفات متاحة لإدراجها في مساحات العمل في أداة اختيار المستندات.",
      branch: "المجلد الذي ترغب في استرداد الملفات منه",
      branch_loading: "-- تحميل الفروع المتاحة --",
      branch_explained: "المجلد الذي ترغب في استرداد الملفات منه.",
      token_information:
        "بسبب قيود معدل الوصول إلى واجهة برمجة التطبيقات العامة لـ GitLab، لن يتمكن هذا الموصل من البيانات من جمع الملفات ذات المستوى الأعلى فقط في المستودع.",
      token_personal: "احصل على رمز وصول شخصي مجاني مع حساب GitLab هنا.",
    },
    youtube: {
      name: "نص فيديو يوتيوب",
      description: "استيراد نص فيديو يوتيوب بأكمله من رابط.",
      URL: "عنوان الفيديو على يوتيوب",
      URL_explained_start:
        "أدخل عنوان URL لأي مقطع فيديو على يوتيوب للحصول على نص الفيديو. يجب أن يحتوي الفيديو على",
      URL_explained_link: "الترجمة المصاحبة",
      URL_explained_end: "متاح.",
      task_explained:
        "بمجرد الانتهاء، سيكون النص متاحًا لإدراجه في مساحات العمل في أداة اختيار المستندات.",
      language: "لغة التسجيل",
      language_explained: "حدد لغة النص الذي ترغب في جمعه.",
      loading_languages: "-- تحميل اللغات المتاحة --",
    },
    "website-depth": {
      name: "أداة لجمع الروابط بكميات كبيرة",
      description:
        "استخراج محتوى موقع ويب وجميع الروابط الفرعية حتى مستوى معين.",
      URL: "عنوان الموقع الإلكتروني",
      URL_explained: "عنوان الموقع الإلكتروني الذي ترغب في استخراجه.",
      depth: "عمق الغوص",
      depth_explained:
        "هذا هو عدد الروابط التي يجب على العامل اتباعها من عنوان URL الأصلي.",
      max_pages: "الحد الأقصى لعدد الصفحات",
      max_pages_explained: "الحد الأقصى لعدد الروابط التي يجب استخراجها.",
      task_explained:
        "بمجرد الانتهاء، سيكون المحتوى الذي تم استخراجه متاحًا لإدراجه في مساحات العمل في أداة اختيار المستندات.",
    },
    confluence: {
      name: "التلاقي",
      description: "استيراد صفحة كاملة من Confluence بنقرة واحدة.",
      deployment_type: "نوع نشر التطبيق",
      deployment_type_explained:
        "حدد ما إذا كان مثيل Confluence الخاص بك مُستضافًا على سحابة Atlassian أم أنه مُستضاف ذاتيًا.",
      base_url: "عنوان قاعدة البيانات",
      base_url_explained: "هذا هو عنوان URL الأساسي لمساحتك في Confluence.",
      space_key: "مفتاح مساحة التجمع",
      space_key_explained:
        "هذا هو مفتاح المساحات الخاص بمثيل Confluence الخاص بك، والذي سيتم استخدامه. وعادةً ما يبدأ بـ ~",
      username: "اسم المستخدم",
      username_explained: "اسم المستخدم الخاص بك في Confluence",
      auth_type: "نوع المصادقة:",
      auth_type_explained:
        "حدد نوع المصادقة الذي ترغب في استخدامه للوصول إلى صفحات Confluence الخاصة بك.",
      auth_type_username: "اسم المستخدم ورمز الوصول",
      auth_type_personal: "رمز الوصول الشخصي",
      token: "رمز الوصول إلى منطقة التجمع",
      token_explained_start:
        "يجب عليك تقديم رمز وصول للمصادقة. يمكنك إنشاء رمز وصول.",
      token_explained_link: "هنا",
      token_desc: "رمز الوصول للمصادقة",
      pat_token: "رمز الوصول الشخصي الخاص بـ Confluence",
      pat_token_explained: "رمز الوصول الشخصي الخاص بك.",
      task_explained:
        "بمجرد الانتهاء، سيتم توفير محتوى الصفحة للاستخدام في تضمينها في مساحات العمل في أداة اختيار المستندات.",
      bypass_ssl: "تجاوز التحقق من شهادة SSL",
      bypass_ssl_explained:
        "قم بتمكين هذا الخيار لتجاوز عملية التحقق من شهادة SSL لبيئات Confluence المستضافة ذاتيًا باستخدام شهادة موقعة ذاتيًا.",
    },
    manage: {
      documents: "وثائق",
      "data-connectors": "وصلات البيانات",
      "desktop-only":
        "تتوفر هذه الإعدادات فقط على جهاز كمبيوتر مكتبي. يرجى الوصول إلى هذه الصفحة على جهاز الكمبيوتر الخاص بك لمواصلة العمل.",
      dismiss: "ارفض",
      editing: "تحرير",
    },
    directory: {
      "my-documents": "وثائقي",
      "new-folder": "مجلد جديد",
      "search-document": "البحث عن المستند",
      "no-documents": "لا توجد مستندات.",
      "move-workspace": "انتقل إلى مساحة العمل",
      name: "الاسم",
      "delete-confirmation":
        "هل أنت متأكد من أنك تريد حذف هذه الملفات والمجلدات؟\nسيؤدي ذلك إلى إزالة الملفات من النظام وإزالتها تلقائيًا من أي مساحات عمل موجودة.\nهذا الإجراء غير قابل للتراجع.",
      "removing-message":
        "حذف {{count}} مستندًا و {{folderCount}} مجلدًا. يرجى الانتظار.",
      "move-success": "تم نقل {{count}} مستندات بنجاح.",
      date: "التاريخ",
      type: "نوع",
      no_docs: "لا توجد مستندات.",
      select_all: "حدد الكل",
      deselect_all: "إلغاء التحديد الكل",
      remove_selected: "حذف المحدد",
      costs: "*تكلفة ثابتة لإنشاء التمثيلات",
      save_embed: "حفظ و تضمين",
    },
    upload: {
      "processor-offline": "غير متاح",
      "processor-offline-desc":
        "لا يمكننا تحميل ملفاتك في الوقت الحالي لأن معالج المستندات غير متصل بالإنترنت. يرجى المحاولة مرة أخرى لاحقًا.",
      "click-upload": "انقر لتحميل أو اسحب وأفلت",
      "file-types":
        "يدعم ملفات النصوص، وملفات CSV، وجداول البيانات، وملفات الصوت، وغيرها!",
      "or-submit-link": "أو قم بإرسال رابط",
      "placeholder-link": "https://example.com",
      fetching: "جاري الاسترجاع...",
      "fetch-website": "احصل على موقع الويب",
      "privacy-notice":
        "سيتم تحميل هذه الملفات إلى معالج المستندات الذي يعمل على هذه نسخة من AnythingLLM. هذه الملفات لا يتم إرسالها أو مشاركتها مع طرف ثالث.",
    },
    pinning: {
      what_pinning: 'ما هو عمل "تثبيت المستندات"؟',
      pin_explained_block1:
        "عندما تقوم بإرفاق مستند في AnythingLLM، سنقوم بإدخال محتوى المستند بالكامل في نافذة المطالبة الخاصة بـ LLM الخاص بك، وذلك حتى يتمكن LLM من فهم المحتوى بالكامل.",
      pin_explained_block2:
        "يعمل هذا بشكل أفضل مع **نماذج ذات سياق كبير** أو ملفات صغيرة ولكنها ضرورية لأساس المعرفة الخاص بها.",
      pin_explained_block3:
        'إذا لم تحصل على الإجابات التي ترغب بها بشكل افتراضي من AnythingLLM، فإن استخدام ميزة "التثبيت" هو طريقة رائعة للحصول على إجابات ذات جودة أعلى في نقرة واحدة.',
      accept: "حسناً، فهمت.",
    },
    watching: {
      what_watching: "ما الذي يفعله مشاهدة فيلم وثائقي؟",
      watch_explained_block1:
        "عندما **تشاهد** مستندًا في AnythingLLM، سيتم **مزامنة** محتوى المستند تلقائيًا من مصدره الأصلي على فترات منتظمة. وهذا سيؤدي إلى تحديث المحتوى تلقائيًا في كل مساحة عمل حيث يتم إدارة هذا الملف.",
      watch_explained_block2:
        "هذه الميزة تدعم حاليًا المحتوى القائم على الإنترنت، ولن تكون متاحة للمستندات التي يتم تحميلها يدويًا.",
      watch_explained_block3_start:
        "يمكنك إدارة المستندات التي يتم عرضها من خلال.",
      watch_explained_block3_link: "مدير الملفات",
      watch_explained_block3_end: "نظرة عامة.\n\n\nنظرة عامة.",
      accept: "حسناً، فهمت.",
    },
    obsidian: {
      name: "أوبشيان",
      description: "استورد مجلد Obsidian بنقرة واحدة.",
      vault_location: "موقع الخزانة",
      vault_description:
        'حدد مجلد "Obsidian" الخاص بك لاستيراد جميع الملاحظات وعلاقاتها.',
      selected_files: "تم العثور على {{count}} ملفات Markdown.",
      importing: "استيراد الخزانة...",
      import_vault: "استيراد منصة Vault",
      processing_time: "قد يستغرق ذلك بعض الوقت، اعتمادًا على حجم الخزانة.",
      vault_warning:
        "لتجنب أي تعارضات، تأكد من أن مجلد Obsidian الخاص بك ليس مفتوحًا حاليًا.",
    },
  },
  chat_window: {
    welcome: "مرحبًا بكم في مساحة عملكم الجديدة.",
    get_started: "للبدء، يمكنك:",
    get_started_default: "للبدء",
    upload: "تحميل مستند",
    or: "أو",
    send_chat: "أرسل رسالة.",
    send_message: "أرسل رسالة",
    attach_file: "أرفق ملفًا بهذا الدردشة",
    slash: "عرض جميع الأوامر المتاحة للتواصل.",
    agents: "عرض جميع الوكلاء المتاحين الذين يمكنك استخدامهم للمحادثة.",
    text_size: "تغيير حجم النص.",
    microphone: "اذكر طلبك.",
    send: "أرسل رسالة فورية إلى مساحة العمل",
    attachments_processing: "جارٍ معالجة المرفقات. يرجى الانتظار...",
    tts_speak_message: "رسالة TTS Speak",
    copy: "انسخ",
    regenerate: "إعادة إنشاء",
    regenerate_response: "أعد الرد",
    good_response: "رد جيد",
    more_actions: "إجراءات إضافية",
    hide_citations: "إخفاء المراجع",
    show_citations: "عرض المراجع",
    pause_tts_speech_message: "إيقاف قراءة النص بصوت التحدث الآلي",
    fork: "شوكة",
    delete: "حذف",
    save_submit: "حفظ وإرسال",
    cancel: "إلغاء",
    edit_prompt: "اقتراح التحرير",
    edit_response: "عدّل الرد",
    at_agent: "@agent",
    default_agent_description: "- الوكيل الافتراضي لهذا المساحة.",
    custom_agents_coming_soon: "سيصل وكلاء مخصصون قريباً!",
    slash_reset: "/reset",
    preset_reset_description: "امسح سجل الدردشة الخاص بك وابدأ محادثة جديدة",
    add_new_preset: "إضافة إعداد مسبق",
    command: "أمر",
    your_command: "أمرك",
    placeholder_prompt: "هذا هو المحتوى الذي سيتم إدخاله أمام سؤالك.",
    description: "وصف",
    placeholder_description: "يستجيب ببيت شعر عن نماذج اللغة الكبيرة.",
    save: "حفظ",
    small: "صغير",
    normal: "طبيعي",
    large: "كبير",
    workspace_llm_manager: {
      search: "البحث عن مزودي نماذج اللغة الكبيرة",
      loading_workspace_settings: "تحميل إعدادات مساحة العمل...",
      available_models: "الموديلات المتاحة لـ {{provider}}",
      available_models_description: "حدد نموذجًا للاستخدام في هذا المساحة.",
      save: "استخدم هذا النموذج.",
      saving: "تعيين النموذج كإعداد افتراضي للمساحة العملية...",
      missing_credentials: "هذا المزود لا يمتلك المؤهلات اللازمة!",
      missing_credentials_description: "انقر لإعداد بيانات الاعتماد",
    },
  },
  profile_settings: {
    edit_account: "تحرير الحساب",
    profile_picture: "صورة الملف الشخصي",
    remove_profile_picture: "حذف صورة الملف الشخصي",
    username: "اسم المستخدم",
    new_password: "كلمة مرور جديدة",
    password_description: "يجب أن يكون طول كلمة المرور 8 أحرف على الأقل.",
    cancel: "إلغاء",
    update_account: "تحديث الحساب",
    theme: "تفضيلات الموضوع",
    language: "اللغة المفضلة",
    failed_upload: "فشل تحميل صورة الملف الشخصي: {{error}}",
    upload_success: "تم تحميل صورة الملف الشخصي.",
    failed_remove: "فشل إزالة صورة الملف الشخصي: {{error}}",
    profile_updated: "تم تحديث الملف الشخصي.",
    failed_update_user: "فشل تحديث المستخدم: {{error}}",
    account: "حساب",
    support: "الدعم",
    signout: "تسجيل الخروج",
  },
  customization: {
    interface: {
      title: "تفضيلات واجهة المستخدم",
      description: "حدد تفضيلات واجهة المستخدم الخاصة بـ AnythingLLM.",
    },
    branding: {
      title: "التسويق بالعلامة التجارية ووضع العلامات التجارية",
      description:
        "قم بتخصيص نسخة AnythingLLM الخاصة بك باستخدام العلامات التجارية الخاصة بك.",
    },
    chat: {
      title: "دردشة",
      description: "حدد تفضيلات الدردشة الخاصة بك لـ AnythingLLM.",
      auto_submit: {
        title: "إرسال تلقائي للمدخلات الصوتية",
        description: "إرسال تلقائي لإدخال الكلام بعد فترة من الصمت",
      },
      auto_speak: {
        title: "ردود آلية",
        description: "إجابات تلقائية من الذكاء الاصطناعي",
      },
      spellcheck: {
        title: "تمكين التدقيق الإملائي",
        description: "تمكين أو تعطيل التدقيق الإملائي في حقل إدخال الرسائل",
      },
    },
    items: {
      theme: {
        title: "الموضوع",
        description: "حدد نظام الألوان المفضل لديك للتطبيق.",
      },
      "show-scrollbar": {
        title: "إظهار شريط التمرير",
        description: "تمكين أو تعطيل شريط التمرير في نافذة الدردشة.",
      },
      "support-email": {
        title: "دعم البريد الإلكتروني",
        description:
          "حدد عنوان البريد الإلكتروني للدعم الذي يجب أن يكون متاحًا للمستخدمين عند الحاجة إلى المساعدة.",
      },
      "app-name": {
        title: "اسم",
        description: "حدد اسمًا يظهر في صفحة تسجيل الدخول لجميع المستخدمين.",
      },
      "chat-message-alignment": {
        title: "مواءمة رسائل الدردشة",
        description: "حدد وضع محاذاة الرسائل عند استخدام واجهة الدردشة.",
      },
      "display-language": {
        title: "اللغة المعروضة",
        description:
          "حدد اللغة المفضلة لعرض واجهة مستخدم AnythingLLM - عند توفر الترجمات.",
      },
      logo: {
        title: "شعار العلامة التجارية",
        description: "قم بتحميل شعارك المخصص لعرضه على جميع الصفحات.",
        add: "أضف شعارًا مخصصًا",
        recommended: "الحجم الموصى به: 800 × 200",
        remove: "احذف",
        replace: "استبدل",
      },
      "welcome-messages": {
        title: "أهلاً وسهلاً",
        description:
          "خصص الرسائل الترحيبية المعروضة لمستخدميك. سيتمكن المستخدمون غير المسؤولين فقط من رؤية هذه الرسائل.",
        new: "جديد",
        system: "نظام",
        user: "المعلومات التي قدمتها، بالإضافة إلى المعلومات التي تم جمعها من مصادر أخرى، ستساعد في تحديد موقع هذا الشخص.",
        message: "رسالة",
        assistant: "مساعد الدردشة من AnythingLLM",
        "double-click": "انقر نقرًا مزدوجًا لتحرير...",
        save: "حفظ الرسائل",
      },
      "browser-appearance": {
        title: "مظهر المتصفح",
        description: "خصص مظهر علامة التبويب والعنوان عند فتح التطبيق.",
        tab: {
          title: "العنوان",
          description: "حدد عنوان علامة تبويب مخصصًا عند فتح التطبيق في متصفح.",
        },
        favicon: {
          title: "Favicon",
          description: "استخدم أيقونة مخصصة لعلامة المتصفح.",
        },
      },
      "sidebar-footer": {
        title: "عناصر تذييل الشريط الجانبي",
        description:
          "خصص عناصر التذييل المعروضة في الجزء السفلي من الشريط الجانبي.",
        icon: "رمز",
        link: "رابط",
      },
      "render-html": {
        title: "تحويل HTML إلى تنسيق نصي في الدردشة",
        description:
          "تقديم استجابات HTML في استجابات المساعد.\nيمكن أن يؤدي ذلك إلى تحسين كبير في جودة الاستجابة، ولكنه قد يؤدي أيضًا إلى مخاطر أمنية محتملة.",
      },
    },
  },
  "main-page": {
    noWorkspaceError: "يرجى إنشاء مساحة عمل قبل البدء في الدردشة.",
    checklist: {
      title: "البدء",
      tasksLeft: "المهام المتبقية",
      completed: "أنت على طريق أن تصبح خبيرًا في مجال نماذج لغة AnythingLLM!",
      dismiss: "أغلق",
      tasks: {
        create_workspace: {
          title: "إنشاء مساحة عمل",
          description: "إنشاء مساحة عمل أولية للبدء",
          action: "إنشاء",
        },
        send_chat: {
          title: "أرسل رسالة",
          description: "ابدأ محادثة مع مساعدك الذكي",
          action: "دردشة",
        },
        embed_document: {
          title: "إدراج مستند",
          description: "أضف المستند الأول الخاص بك إلى مساحة العمل الخاصة بك",
          action: "دمج",
        },
        setup_system_prompt: {
          title: "قم بإنشاء نظام موجه.",
          description: "قم بتكوين سلوك مساعدك الذكي.",
          action: "إعداد",
        },
        define_slash_command: {
          title: "حدد أمر القطع",
          description: "إنشاء أوامر مخصصة لمساعدك",
          action: "عرف",
        },
        visit_community: {
          title: "زيارة مركز المجتمع",
          description: "استكشف موارد المجتمع وقوالبها",
          action: "تصفح",
        },
      },
    },
    quickLinks: {
      title: "روابط سريعة",
      sendChat: "أرسل الدردشة",
      embedDocument: "إدراج مستند",
      createWorkspace: "إنشاء مساحة عمل",
    },
    exploreMore: {
      title: "استكشف المزيد من الميزات",
      features: {
        customAgents: {
          title: "وكلاء الذكاء الاصطناعي المخصصين",
          description:
            "قم ببناء وكلاء ذكاء اصطناعي قويين وأتمتيات بدون الحاجة إلى كتابة التعليمات البرمجية.",
          primaryAction: "استخدم الدردشة مع @agent",
          secondaryAction: "صمم مسارًا لعميل",
        },
        slashCommands: {
          title: "أوامر السطر الأوامر",
          description: "وفر الوقت وأدخل الأوامر باستخدام أوامر مخصصة.",
          primaryAction: "إنشاء أمر سطر أوامر",
          secondaryAction: "استكشف على Hub",
        },
        systemPrompts: {
          title: "مطالبات النظام",
          description:
            "عدّل مطالبة النظام لتخصيص ردود الذكاء الاصطناعي في مساحة العمل.",
          primaryAction: "عدّل مطالبة النظام",
          secondaryAction: "إدارة المتغيرات المحددة",
        },
      },
    },
    announcements: {
      title: "التحديثات والإعلانات",
    },
    resources: {
      title: "الموارد",
      links: {
        docs: "وثائق",
        star: "نجمة على GitHub",
      },
      keyboardShortcuts: "اختصارات لوحة المفاتيح",
    },
  },
  "keyboard-shortcuts": {
    title: "اختصارات لوحة المفاتيح",
    shortcuts: {
      settings: "فتح الإعدادات",
      workspaceSettings: "فتح إعدادات مساحة العمل الحالية",
      home: "اذهب إلى الصفحة الرئيسية",
      workspaces: "إدارة مساحات العمل",
      apiKeys: "إعدادات مفاتيح واجهة برمجة التطبيقات",
      llmPreferences: "تفضيلات نموذج اللغة الكبيرة",
      chatSettings: "إعدادات الدردشة",
      help: "عرض مسرّعات لوحة المفاتيح",
      showLLMSelector: "اختر مساحة العمل",
    },
  },
  community_hub: {
    publish: {
      system_prompt: {
        success_title: "نجاح!",
        success_description: "تم نشر مطالبتك في نظامك على منصة المجتمع!",
        success_thank_you: "شكراً لمشاركتكم في المجتمع!",
        view_on_hub: "عرض على منصة المجتمع",
        modal_title: "نص الإشعار",
        name_label: "اسم",
        name_description: "هذا هو اسم العرض الخاص بنظامك.",
        name_placeholder: "تعليمات النظام الخاص بي",
        description_label: "وصف",
        description_description:
          "هذا هو وصف لتعليمات النظام الخاصة بك. استخدم هذا لوصف الغرض من تعليمات النظام الخاصة بك.",
        tags_label: "الوسوم",
        tags_description:
          "تُستخدم العلامات لتسمية مطالبتك في النظام لتسهيل البحث. يمكنك إضافة عدة علامات. الحد الأقصى لعدد العلامات هو 5. الحد الأقصى لعدد الأحرف في كل علامة هو 20 حرفًا.",
        tags_placeholder: "أدخل النص واضغط على مفتاح الإدخال لإضافة العلامات",
        visibility_label: "رؤية",
        public_description: "تظهر إشعارات النظام العامة للجميع.",
        private_description: "رسائل التذكير الخاصة مرئية فقط لك.",
        publish_button: "نشر في مركز المجتمع",
        submitting: "نشر...",
        submit: "نشر في مركز المجتمع",
        prompt_label:
          "الرجاء تقديم معلومات حول كيفية الحصول على شهادة في مجال تكنولوجيا المعلومات.",
        prompt_description:
          "هذا هو الأمر المباشر الفعلي الذي سيتم استخدامه لتوجيه نموذج اللغة الكبير.",
        prompt_placeholder: "أدخل تعليمات النظام هنا...",
      },
      agent_flow: {
        public_description: "يمكن رؤية تدفقات الوكلاء العامة للجميع.",
        private_description: "تدفقات الوكلاء الخاصة مرئية فقط لك.",
        success_title: "نجاح!",
        success_description: 'تم نشر "Agent Flow" الخاص بك في مركز المجتمع!',
        success_thank_you: "شكراً لمشاركتكم في المجتمع!",
        view_on_hub: "عرض على منصة المجتمع",
        modal_title: "مخطط تدفق الوكيل",
        name_label: "الاسم",
        name_description: "هذا هو اسم العرض الخاص بمسار الممثل.",
        name_placeholder: 'وكيلتي، "فلو"',
        description_label: "وصف",
        description_description:
          "هذا هو وصف لتدفق العمل الخاص بك. استخدم هذا لوصف الغرض من تدفق العمل الخاص بك.",
        tags_label: "الوسوم",
        tags_description:
          "تُستخدم العلامات لتصنيف مسارات عملك لتسهيل البحث. يمكنك إضافة عدة علامات. الحد الأقصى لعدد العلامات هو 5. الحد الأقصى لعدد الأحرف في كل علامة هو 20 حرفًا.",
        tags_placeholder: "أدخل النص واضغط على مفتاح الإدخال لإضافة العلامات",
        visibility_label: "رؤية",
        publish_button: "نشر في مركز المجتمع",
        submitting: "نشر...",
        submit: "نشر في مركز المجتمع",
        privacy_note:
          "يتم تحميل تدفقات البيانات دائمًا كخاصة لحماية أي بيانات حساسة. يمكنك تغيير مستوى الوصول في مركز المجتمع بعد النشر. يرجى التأكد من أن تدفقك لا يحتوي على أي معلومات حساسة أو خاصة قبل النشر.",
      },
      generic: {
        unauthenticated: {
          title: "يتطلب التحقق",
          description:
            "يجب عليك التحقق من هويتك مع مركز مجتمع AnythingLLM قبل نشر أي محتوى.",
          button: "تواصل مع مركز المجتمع",
        },
      },
      slash_command: {
        success_title: "نجاح!",
        success_description: "تم نشر أمر Slash الخاص بك في مركز المجتمع!",
        success_thank_you: "شكراً لمشاركتكم في المجتمع!",
        view_on_hub: "عرض على منصة المجتمع",
        modal_title: "نشر أمر Slash",
        name_label: "اسم",
        name_description: "هذا هو اسم العرض الخاص بأمرك.",
        name_placeholder: "أمر السلايش الخاص بي",
        description_label: "وصف",
        description_description:
          "هذا هو وصف أمر السلايش الخاص بك. استخدم هذا لوصف الغرض من أمر السلايش الخاص بك.",
        command_label: "أمر",
        command_description:
          "هذا هو الأمر الذي سيدخله المستخدمون لتفعيل هذا الإعداد المسبق.",
        command_placeholder: "أمرى",
        tags_label: "الوسوم",
        tags_description:
          "تُستخدم العلامات لتسمية أوامر سلاش الخاصة بك لتسهيل البحث عنها. يمكنك إضافة عدة علامات. الحد الأقصى لعدد العلامات هو 5. الحد الأقصى لعدد الأحرف في كل علامة هو 20 حرفًا.",
        tags_placeholder: "أدخل النص واضغط على مفتاح الإدخال لإضافة العلامات",
        visibility_label: "رؤية",
        public_description: "الأوامر العامة مرئية للجميع.",
        private_description: "الأوامر الخاصة مرئية فقط لك.",
        publish_button: "نشر في مركز المجتمع",
        submitting: "نشر...",
        prompt_label: "الاستعلام",
        prompt_description:
          "هذا هو الأمر الذي سيتم استخدامه عند تفعيل الأمر الذي يتضمن الشرطة.",
        prompt_placeholder: "أدخل سؤالك هنا...",
      },
    },
  },
  security: {
    title: "حماية",
    multiuser: {
      title: "وضعية المستعملين المتعددين",
      description:
        "قم بإعداد مثيلك لدعم فريقك من خلال تنشيط وضعية المستعملين المتعددين.",
      enable: {
        "is-enable": "تم تمكين وضعية المستعملين المتعددين",
        enable: "تمكين وضعية المستعملين المتعددين",
        description:
          "افتراضيًا، ستكون أنت المشرف الوحيد. وبصفتك مشرفا ستحتاج إلى إنشاء حسابات لجميع المستعملين أو المشرفين الجدد. لا تفقد كلمة مرورك، حيث يمكن فقط للمستعمل المشرف إعادة تعيين كلمات المرور.",
        username: "اسم المستعمل لحساب المشرف",
        password: "كلمة مرور حساب المشرف",
      },
    },
    password: {
      title: "حماية كلمة المرور",
      description:
        "إحم مثيل إني ثينك إلْلْمْ بكلمة المرور. إذا نسيتها فلا يوجد طريقة لاستردادها، فاحرص على حفظها.",
      "password-label": "كلمة مرور المثيل",
    },
  },
  home: {
    welcome: "مرحبا",
    chooseWorkspace: "اختر مساحة العمل لبدء المحادثة!",
    notAssigned:
      "لا تم التخصيص لأي مساحة عمل.\nيرجى الاتصال بمدير المثيل لطلب الوصول إلى مساحة عمل.",
    goToWorkspace: 'الذهاب إلى "{{workspace}}"',
  },
};

export default TRANSLATIONS;
